[{
    "id": "324c3b9a-d073-4459-9f98-292cb8e50186",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/324c3b9a-d073-4459-9f98-292cb8e50186",
    "created_at": "Fri Mar 06 20:09:30 UTC 2020",
    "company": "UPPAbaby",
    "company_url": "https://uppababy.com",
    "location": "Rockland, MA",
    "title": "Senior Back-End Web Developer",
    "description": "\u003cp\u003eWe are looking for an experienced back-end developer to take ownership over the back-end of our website and present creative solutions to established objectives as well as take a proactive approach to enhancing user experience. UPPAbaby is about to embark on a complete redesign of our front and back end code, so you would have a high level of creative, technical, and structural influence in that project. This is great opportunity for someone looking to get involved and take ownership of a redesign from the ground up.\u003c/p\u003e\n\u003cp\u003eThis is a full-time position and your focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your coworkers into the application. A basic understanding of front-end technologies is therefore necessary as well.\u003c/p\u003e\n\u003cp\u003eThe ideal candidate will have the abilities to manage the technical workload along with effectively communicating in a flexible, team-based environment. You will work closely with the front-end developer, designers, and external development teams on building, modifying, updating, and maintaining current and new systems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Collaborating with the front-end developers, other team members, and external teams to establish objectives and design more functional, cohesive codes to enhance the user experience\u003c/p\u003e\n\u003cp\u003e-Building reusable code and libraries for future use\u003c/p\u003e\n\u003cp\u003e-Optimization of the application for maximum speed and scalability\u003c/p\u003e\n\u003cp\u003e-Implementation of security and data protection\u003c/p\u003e\n\u003cp\u003e-Design and implementation of data storage solutions\u003c/p\u003e\n\u003cp\u003e-Engineer and utilize APIs and other up-to-date technologies to interact with other systems \u0026amp; applications\u003c/p\u003e\n\u003cp\u003e-Build user-centric solutions with an emphasis on best practices and WCAG accessibility requirements\u003c/p\u003e\n\u003cp\u003e-Taking lead on projects, as needed\u003c/p\u003e\n\u003cp\u003e-Developing ideas for new programs, products, or features by monitoring industry developments and trends\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIRED SKILLS AND EXPERIENCE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-5+ years of direct experience\u003c/p\u003e\n\u003cp\u003e-Strong problem solving, critical thinking, writing and communication skills\u003c/p\u003e\n\u003cp\u003e-Self-starter with ability to work independently in a fast moving, quickly changing environment\u003c/p\u003e\n\u003cp\u003e-Understanding accessibility and security compliance\u003c/p\u003e\n\u003cp\u003e-User authentication and authorization between multiple systems, servers, and environments\u003c/p\u003e\n\u003cp\u003e-Integration of multiple data sources and databases into one system\u003c/p\u003e\n\u003cp\u003e-Management of hosting environment, including database administration and scaling an application to support load changes\u003c/p\u003e\n\u003cp\u003e-Data migration, transformation, and scripting\u003c/p\u003e\n\u003cp\u003e-Setup and administration of backups\u003c/p\u003e\n\u003cp\u003e-Outputting data in different formats\u003c/p\u003e\n\u003cp\u003e-Understanding differences between multiple delivery platforms such as mobile vs desktop, and optimizing output to match the specific platform\u003c/p\u003e\n\u003cp\u003e-Creating database schemas that represent and support business processes\u003c/p\u003e\n\u003cp\u003e-Implementing automated testing platforms and unit tests\u003c/p\u003e\n\u003cp\u003e-Must have advanced understanding of WordPress and related technologies\u003c/p\u003e\n\u003cp\u003e-Proficient knowledge of the following back-end programming languages:\u003c/p\u003e\n\u003cp\u003e-MySQL, AJAX, PHP, Java, JavaScript, jQuery (required)\u003c/p\u003e\n\u003cp\u003e-React or related Javascript framework (highly preferred)\u003c/p\u003e\n\u003cp\u003e-Ruby (a plus)\u003c/p\u003e\n\u003cp\u003e-Experience with back-end frameworks and CMS environments\u003c/p\u003e\n\u003cp\u003e-Understanding of responsive front-end frameworks and development\u003c/p\u003e\n\u003cp\u003e-Proficient understanding of code versioning tools, such as Git\u003c/p\u003e\n\u003cp\u003e-Proficient understanding of OWASP security principles\u003c/p\u003e\n\u003cp\u003e-Understanding of “session management” in a distributed server environment\u003c/p\u003e\n\u003cp\u003e-Must be able to be onsite 2-3 days a week, subject to change as position evolves\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSTRONGLY PREFERRED EXPERIENCE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Familiarity and ability to work with the following:\u003c/p\u003e\n\u003cp\u003e-WooCommerce\u003c/p\u003e\n\u003cp\u003e-WordPress\u003c/p\u003e\n\u003cp\u003e-NetSuite\u003c/p\u003e\n\u003cp\u003e-Basic understanding of front-end technologies and platforms, such as JavaScript, HTML5, and CSS3\u003c/p\u003e\n\u003cp\u003e-Good understanding of server-side CSS preprocessors, such as LESS and SASS\u003c/p\u003e\n\u003cp\u003e-Native application development\u003c/p\u003e\n\u003cp\u003e-Basic understanding of SEO principles\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eABOUT UPPABABY\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBased in Rockland, Mass., UPPAbaby is on a mission to make the smartest strollers, car seats and juvenile gear available: intuitively designed, stylish and sleek, with the features and functions new parents want—plus innovations they never knew were possible.\u003c/p\u003e\n\u003cp\u003eOur company is laid back, with a collaborative culture and a variety of benefits, including:\u003c/p\u003e\n\u003cp\u003eCompetitive salary\u003c/p\u003e\n\u003cp\u003eHealth, dental and vision insurance\u003c/p\u003e\n\u003cp\u003e401K and life insurance\u003c/p\u003e\n\u003cp\u003eNo dress code\u003c/p\u003e\n\u003cp\u003eFlexible hours\u003c/p\u003e\n\u003cp\u003eWeekly catered lunches\u003c/p\u003e\n\u003cp\u003eFree snacks, drinks and cold brew on tap\u003c/p\u003e\n\u003cp\u003eIn-house gym\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://uppababy.typeform.com/to/OJIdvz\"\u003ehttps://uppababy.typeform.com/to/OJIdvz\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbCtBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fae31e23baf01dea30a08ce322586f67ca72b76c/Logo.png"
  },
  {
    "id": "fb157439-bc4f-4dec-8336-1f90033ea3b4",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/fb157439-bc4f-4dec-8336-1f90033ea3b4",
    "created_at": "Thu Mar 05 10:27:49 UTC 2020",
    "company": "Credit Glory",
    "company_url": "http://http",
    "location": "Remote",
    "title": "Senior Full Stack Dev [Rails] (Full Remote)",
    "description": "\u003cp\u003e\u003cstrong\u003eWho the heck are we?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe're a simple Credit Repair company--we help people fix their credit so they can buy homes.\u003c/p\u003e\n\u003cp\u003eOur business consists of a small team of 20 people that are all remote (Canada, NZ, US, UAE, and Philippines).\u003c/p\u003e\n\u003cp\u003eAs of this month we're on a 2mm runrate after incorporating in November. So, we're growing fast and dealing with the struggles that come with a lack of processes. This is the fun part! (For some of us.)\u003c/p\u003e\n\u003cp\u003eJust to name a few benefits:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003efully remote\u003c/li\u003e\n\u003cli\u003esignificant, immediate rev share\u003c/li\u003e\n\u003cli\u003efuture equity on next businesses\u003c/li\u003e\n\u003cli\u003eno timezone requirements\u003c/li\u003e\n\u003cli\u003emake your own hours\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat do we need?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf you're senior-level in Ruby/Rails, ambitious, and a quick learner, you'll do great helping us scale our backend to support our clients, affiliates, marketing, and biz dev.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail github/linkedin/resume/cv to \u003ca href=\"mailto:alex@creditglory.com\"\u003ealex@creditglory.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThanks!\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "5b8a423a-0a7d-428c-b080-eaf5ae2b49cb",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/5b8a423a-0a7d-428c-b080-eaf5ae2b49cb",
    "created_at": "Wed Mar 04 09:55:58 UTC 2020",
    "company": "cognita Deutschland GmbH\t",
    "company_url": "https://cognita.ch/",
    "location": "Berlin",
    "title": "Ruby Full Stack Developer (m/f)",
    "description": "\u003cp\u003ecognita develops the issue and media monitoring software blueReport which collects relevant information from all types of media: online news sites, social media, newspapers, radio and TV. The state-of-the-art SaaS platform is continually improved by our development team. Our customers include leading corpora-tions, organizations and media and communication agencies across Europe.\u003c/p\u003e\n\u003cp\u003eTo extend our development team in Berlin immediately we are looking for a full time Ruby Full Stack Developer (m/f).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you will do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou collaborate with the team to bring new product ideas from brainstorming to deployment\u003c/li\u003e\n\u003cli\u003eYou will bring our products to the next level and improve it continuously with the latest technology\u003c/li\u003e\n\u003cli\u003eYou are part of an agile development team in Berlin where your contribution makes a difference and can have a big impact\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you bring to the team\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYour proven track record with Ruby, Ruby on Rails, databases (e.g. Postgresql, Elasticsearch, Redis) and Javascript (or TypeScript) boost the product from the very first day\u003c/li\u003e\n\u003cli\u003eSoftware and database architecture is part of your professional background\u003c/li\u003e\n\u003cli\u003eYou work well in a team and you are also able to finish projects on your own\u003c/li\u003e\n\u003cli\u003eYou are a great communicator, fluent in English (German is a plus) and you enable your team to find optimal and practicable solutions by actively participating in team discussions\u003c/li\u003e\n\u003cli\u003eWith your experience and your strong eye for detail, you find the balance between pragmatism and perfectionism\u003c/li\u003e\n\u003cli\u003eYour are familiar with agile development (Scrum)\u003c/li\u003e\n\u003cli\u003eExperience with React, Android and iOS App development and AWS is a plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho we are\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe are a straightforward and talented development team in a fast-growing company\u003c/li\u003e\n\u003cli\u003eWe continually learn from each other due to varied backgrounds and interests\u003c/li\u003e\n\u003cli\u003eWe mainly use Ruby and TypeScript, but also run JRuby and JavaScript in production\u003c/li\u003e\n\u003cli\u003eGreat office in Berlin Mitte, well connected to public transportation\u003c/li\u003e\n\u003cli\u003eFlexible working hours, no micromanagement, flat hierarchy and of course drinks, fruit \u0026amp; vegetables\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInterested? Just send us your application. Questions? Don’t hesitate to ask. We are looking forward to hearing from you soon.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://cognita.join.com/jobs/810991-ruby-full-stack-developer-m-f?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=ruby%2Bfull%2Bstack%2Bdeveloper%2Bm%2Bf\"\u003ehttps://cognita.join.com/jobs/810991-ruby-full-stack-developer-m-f?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=ruby%2Bfull%2Bstack%2Bdeveloper%2Bm%2Bf\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDJBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3f037d7ac199bfb5e30a5c4a7ff902304fd27c08/cognita-deutschland-gmb-h-logo-xl.png"
  },
  {
    "id": "8a601aa0-efb7-4697-b139-6ce078bc1d38",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/8a601aa0-efb7-4697-b139-6ce078bc1d38",
    "created_at": "Thu Feb 27 17:02:47 UTC 2020",
    "company": "Wrapbook",
    "company_url": "https://www.wrapbook.com",
    "location": "Toronto, Canada",
    "title": "Senior Ruby Developer",
    "description": "\u003cp\u003eAs a Senior Ruby Developer, you will work alongside a product manager, designer and other developers on developing features for the Wrapbook app. You will also help provide feedback and guidance to junior web developers and web developers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHere's what you need to qualify for this job:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeveloped and shipped applications using Ruby on Rails\u003c/li\u003e\n\u003cli\u003eCapable of taking on full features from concept to production with minimal to no supervision\u003c/li\u003e\n\u003cli\u003e5+ years of experience as a web developer, including 2+ as a senior web developer\u003c/li\u003e\n\u003cli\u003eWorked with PostgreSQL extensively in the past. You know how to analyze and optimize queries\u003c/li\u003e\n\u003cli\u003eCompleted a bachelor's degree in Computer Science, Engineering or related field, equivalent training or fellowship\u003c/li\u003e\n\u003cli\u003eProficiency in another programming language aside from ruby\u003c/li\u003e\n\u003cli\u003eDeveloped RESTful APIs in the past\u003c/li\u003e\n\u003cli\u003eMust be based in the GTA area\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Wrapbook\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWrapbook is a digital service for workforces and employers in media production. Wrapbook provides profiles that facilitate onboarding, paying and insuring workforces compliantly. Unlike traditional payroll, Wrapbook is easy to use, fast to wrap, and costs less.\u003c/p\u003e\n\u003cp\u003eWrapbook was created by a team of filmmakers and technologists who are making it easier and more affordale for filmmakers to bring their projects to life.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply here: \u003ca href=\"https://careers.wrapbook.com/o/senior-ruby-developer\"\u003ehttps://careers.wrapbook.com/o/senior-ruby-developer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0ovIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4a5f11bd8874ceaa7accd7a65dbf4103454f0332/square.png"
  },
  {
    "id": "e45ef1f5-e66c-4778-aaee-dca862c572f6",
    "type": "remote",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/e45ef1f5-e66c-4778-aaee-dca862c572f6",
    "created_at": "Mon Feb 24 01:12:32 UTC 2020",
    "company": "Prota Ventures",
    "company_url": null,
    "location": "Remote",
    "title": "Senior Software Engineer",
    "description": "\u003cp\u003eAbout Prota:\u003c/p\u003e\n\u003cp\u003eProta Ventures brings experience, capital, community and direction to bold ideas. We power new projects, invest in early-stage startups and seek out the true invention. Our teams utilize time-tested approaches, strategic thinking, story-driven design, and rock-solid engineering to bring products to market in the digital \u0026amp; physical spaces, IoT, emerging technologies, and more. We are a fully remote organization that works across time zones and borders. We are located in Chicago, New York, Seattle and Belgrade. We are growing rapidly. We work with both Fortune 500s and new founder teams. Every member of Prota is expected to bring a genuine entrepreneurial spirit to the table; many of our product ideas are generated internally and brought to market in collaboration with our incubation partners. This is a remote contract role that can be, freelance, part-time or full-time.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeveloping front-end web (React/Redux) and mobile (React Native) architecture.\u003c/li\u003e\n\u003cli\u003eDeveloping server-side web application architecture and logic (Ruby on Rails API).\u003c/li\u003e\n\u003cli\u003eArchitecting Databases (PostgreSQL) and data IO from 3rd-party APIs.\u003c/li\u003e\n\u003cli\u003eOptimizing User Experience across web and mobile platforms\u003c/li\u003e\n\u003cli\u003eEnsuring responsiveness, performance, and scalability of applications\u003c/li\u003e\n\u003cli\u003eDesigning and developing APIs\u003c/li\u003e\n\u003cli\u003eParticipating in the overall application lifecycle while focusing on coding and debugging\u003c/li\u003e\n\u003cli\u003eCollaborating with Technical product leads and front-end developers\u003c/li\u003e\n\u003cli\u003eDefining and communicating technical and design requirements\u003c/li\u003e\n\u003cli\u003eTraining, helping and supporting other team members\u003c/li\u003e\n\u003cli\u003eBuilding high-quality reusable code\u003c/li\u003e\n\u003cli\u003eDeveloping functional and sustainable web applications with clean, readable code\u003c/li\u003e\n\u003cli\u003eTroubleshooting and debugging applications\u003c/li\u003e\n\u003cli\u003eLearning about and integrating new technologies\u003c/li\u003e\n\u003cli\u003eStaying up to date with current best practices\u003c/li\u003e\n\u003cli\u003eConducting UI tests and optimizing performance\u003c/li\u003e\n\u003cli\u003eCollaborating with a multidisciplinary team of designers, developers, and entrepreneurs\u003c/li\u003e\n\u003cli\u003eParticipating in conferences and educational programs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements and Qualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEntrepreneurial drive: we regularly create, develop, and work with startups and Fortune 500 companies\u003c/li\u003e\n\u003cli\u003e5+ years of experience as a back-end developer\u003c/li\u003e\n\u003cli\u003eIn-depth understanding of web development\u003c/li\u003e\n\u003cli\u003e5+ years of experience with one or more programming languages such as Java, Ruby, PHP, Python, etc.\u003c/li\u003e\n\u003cli\u003e5+ years of experience with a CMS framework\u003c/li\u003e\n\u003cli\u003e5+ years of experience with HTML, JavaScript, CSS\u003c/li\u003e\n\u003cli\u003e2+ years of experience with React (ideally with Redux)\u003c/li\u003e\n\u003cli\u003eCritical thinker and problem-solving skills\u003c/li\u003e\n\u003cli\u003eTeam player with an attitude of “leaving the campsite better than we found it” and “we’ve got each other’s back” state of mind\u003c/li\u003e\n\u003cli\u003eGood organizational and time-management skills\u003c/li\u003e\n\u003cli\u003eParticipation in regular project stand-ups even with potential time zone challenges\u003c/li\u003e\n\u003cli\u003eMeet project deadlines\u003c/li\u003e\n\u003cli\u003eThe ability to effectively communicate with peers, superiors, and stakeholders.\u003c/li\u003e\n\u003cli\u003eThe ability to make rational, logical decisions and the ability to defend them to your peers, superiors, and stakeholders.The humility to understand that they are not the smartest person in the room, and that a person can learn from anyone\u003c/li\u003e\n\u003cli\u003eThe ability to take responsibility for their work and their mistakes.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNice to Have But Not Necessary\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassion for environmentalism and social equality\u003c/li\u003e\n\u003cli\u003eExperience collaborating with designers and developers\u003c/li\u003e\n\u003cli\u003eExperience working on multiple projects at the same\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePerks:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinuous education and skill development.\u003c/li\u003e\n\u003cli\u003eCompetitive wages\u003c/li\u003e\n\u003cli\u003eHuge growth opportunities. Being a part of a quickly growing company in a growing industry, you have an opportunity to learn a lot and grow fast professionally.\u003c/li\u003e\n\u003cli\u003eWorking with leading market technologies.\u003c/li\u003e\n\u003cli\u003eThe professional, forward-thinking and friendly international work atmosphere\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://jsco.re/46j3t\"\u003ehttps://jsco.re/46j3t\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "7ee230b4-7c26-43eb-b993-ddd7dc34fc91",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/7ee230b4-7c26-43eb-b993-ddd7dc34fc91",
    "created_at": "Wed Feb 19 19:57:53 UTC 2020",
    "company": "FlexJobs",
    "company_url": "https://www.flexjobs.com",
    "location": "Remote - U.S. based",
    "title": "iOS developer",
    "description": "\u003cp\u003e\u003cstrong\u003eWho We Are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur mission is to improve the future of work by helping people find flexible jobs that make their lives better. We are committed to doing this internally and externally with integrity, intelligence, balance, communication, and care.\u003c/p\u003e\n\u003cp\u003eIn the past 13 years, FlexJobs has established itself as the leader in the professional flexible job market to help job seekers connect with employers that offer these highly desired arrangements, as well as to help employers reach these candidates. We do this in a way that makes the job search experience easier, safer, and faster for job seekers, by utilizing both technology and human intelligence to provide a friendly, effective, and valuable service.\u003c/p\u003e\n\u003cp\u003eIn terms of work flexibility, we also walk the talk! This is a remote job, as our entire team works remotely from locations all across the United States. Not only that, but having a great company culture is really important to us, and we’ve even been named one of Outside magazine’s Best Places to Work (2019) and Best Company Culture by Entrepreneur magazine (2018, 2017, and 2015).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities of the Job - The Opportunity\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for an experienced iOS developer to join our team. This person will work with our product and development teams to build quality applications, fix bugs, maintain the code, and implement updates as needed.\u003c/p\u003e\n\u003cp\u003eThe ideal candidate will have been a lead app developer or be someone who worked independently. We are looking for someone who has built apps that are currently available in the App Store.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour Experience\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3-5 years of experience in iOS development\u003c/li\u003e\n\u003cli\u003eFluent in Swift, SwiftUI, and UIKit\u003c/li\u003e\n\u003cli\u003eExperience with mobile app networking, storage, and Cocoapods\u003c/li\u003e\n\u003cli\u003eMust have worked on recent consumer-facing projects\u003c/li\u003e\n\u003cli\u003eExperience working with a small and/or entrepreneurially spirited company\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus Points Given\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in the job/employment space\u003c/li\u003e\n\u003cli\u003eExperience with subscription-based apps\u003c/li\u003e\n\u003cli\u003eExperience with Ruby on Rails\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTraits and Skills for This Role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMust be comfortable working independently and in small teams\u003c/li\u003e\n\u003cli\u003eAbility to work quickly and responsibly to meet deadlines and follow timelines\u003c/li\u003e\n\u003cli\u003eYou have to really love coding...like, you need to be one of those people who writes code for fun\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTraits Required of All Team Members, You Included\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA sense of pride in your work\u003c/li\u003e\n\u003cli\u003eA streak of perfectionism when it comes to details\u003c/li\u003e\n\u003cli\u003eBeing highly organized, responsible, and ethical\u003c/li\u003e\n\u003cli\u003eBeing proactive when it comes to asking questions, brainstorming, and working with colleagues\u003c/li\u003e\n\u003cli\u003eExcellent time management and organizational skills\u003c/li\u003e\n\u003cli\u003eAn appreciation and enthusiasm for the ability to work remotely\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOther Requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eInterest in a long-term position with a company that you’re proud to be a part of\u003c/li\u003e\n\u003cli\u003eA fully functioning home office with a reliable development environment\u003c/li\u003e\n\u003cli\u003eA workspace in which you can really focus without distractions\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eIf this job description makes you feel as if it was written perfectly for you, then please apply! What we’ll need:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAn intro email/cover letter telling us why you want to work for FlexJobs (vs. another company), including what your remote work experience has been\u003c/li\u003e\n\u003cli\u003eA portfolio of your work, including projects that are currently in the App Store\u003c/li\u003e\n\u003cli\u003eWhat hourly rate or salary you would be comfortable with\u003c/li\u003e\n\u003cli\u003eA current resume in .doc, .docx, .pdf, markdown, or .txt\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eApplications can be sent by email to \u003ca href=\"mailto:jobs@flexjobs.com\"\u003ejobs@flexjobs.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e*If you are selected to move forward, you may be required to do a background check.\u003c/p\u003e\n\u003cp\u003eFlexJobs is an equal opportunity employer. We celebrate and support diversity and are committed to creating an inclusive work environment for all employees. As a part of this commitment, we have pledged to be an Open to All business.\u003c/p\u003e\n\u003cp\u003eFlexJobs is also a veteran- and military spouse-friendly employer. Our positions are perfectly structured for qualified candidates who meet this criteria and we have a workplace culture that supports their work and life.*\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTkvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bc66b987ae50503ba580266538ab474a17c7b145/fj-lg-square-tagline.png"
  },
  {
    "id": "f574edcf-64c8-4582-b4d8-719d2dc9459f",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/f574edcf-64c8-4582-b4d8-719d2dc9459f",
    "created_at": "Wed Feb 19 10:01:25 UTC 2020",
    "company": "GOhiring GmbH",
    "company_url": "https://www.gohiring.com/",
    "location": "Berlin | Remote",
    "title": "Senior fullstack React / Ruby developer",
    "description": "\u003cp\u003e\u003cstrong\u003eAbout us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for people who are up to the task of digitizing the job advertising market with us. GOhiring offers digital infrastructure for companies, HR IT-systems, job portals and agencies to enable more direct and productive ways of collaborating. That way, job postings can be published via an API and managed with transparency via digital processes. Thanks to state-of-the-art tools, we have also digitized our own working environment and set up everything for #remote work from anywhere in the world.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAs part of our development team, you will be responsible for building smart, customer-driven front- and back-end solutions\u003c/li\u003e\n\u003cli\u003eThis implies solving exciting engineering challenges, starting with MVP’s and iterating from there\u003c/li\u003e\n\u003cli\u003eYou collaborate closely with our experienced team of backend developers, product managers, designers and testers\u003c/li\u003e\n\u003cli\u003eYou work on complex frontend projects using React and other JS frameworks\u003c/li\u003e\n\u003cli\u003eDepending on your interests and skills, you will work on different parts of our product ecosystem\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou get excited about good quality code and engineering quests\u003c/li\u003e\n\u003cli\u003eYou have at least five years experience in web development including +1 year in React.js and +3 years in Ruby. More languages as a bonus.\u003c/li\u003e\n\u003cli\u003eYou value testing, well-documented code and intelligent software design techniques\u003c/li\u003e\n\u003cli\u003eYou already have good knowledge about API Design and performance optimization\u003c/li\u003e\n\u003cli\u003eYou are conversant in English\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat to expect\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRemote culture -\u003c/strong\u003e Work wherever you are most productive - at home, while traveling or in our office in Berlin. Benefit from processes and mindsets which are 100% oriented towards working flexible hours in the location of your choice.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSmall, agile team -\u003c/strong\u003e We believe that work is simply more fun in small teams. Experienced colleagues, jointly defined company targets, a direct exchange and lots of creative leeway: That is what constitutes our understanding of productivity.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eComplex challenges -\u003c/strong\u003e Due to our central role in the market, we are closely interlinked with all the players and are able to reach unparalleled depths when it comes to digitizing business processes. In doing so, we encounter new challenges time and time which are waiting to be solved for the benefit of all market players.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSounds like an interesting challenge for you?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe believe in culture first, skills second: if you are truly interested in this job, you should apply - even if you do not fulfill 100% of the requirements.\u003c/p\u003e\n\u003cp\u003eSimply send us your profile in addition to your Github handle. We look forward to getting to know you better!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eDiversity and equal opportunity are important to us. We are happy about the interest of all candidates and strive to provide feedback as quickly as possible.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/3d7d1327dffc649ac7c9b335a3c6d636cc19afe7/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f63623963333635303533613633313565326137343333613632383435393237626661366339396263306265333763616339386239326265376430633366643231\"\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://tracking.gohiring.com/h/382686f4328977849c660e09bf15d37d0cc6037bce243d1e957b564b7574b196\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDkvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9c49e31211e76265bf63ddd1ebe1fa509d895061/gohiring_logo.png"
  },
  {
    "id": "6aed9bb4-c6c1-46b3-ad82-d4e7f2b7db4f",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/6aed9bb4-c6c1-46b3-ad82-d4e7f2b7db4f",
    "created_at": "Tue Jan 14 15:38:07 UTC 2020",
    "company": "SoundCloud",
    "company_url": "https://jobs.soundcloud.com/",
    "location": "Berlin",
    "title": "Senior Security Engineer (f/m/d)",
    "description": "\u003cp\u003eWhat's next in music happens on SoundCloud first. As the world’s largest open audio platform, SoundCloud is powered by a connected community of creators, listeners and curators who share, discover and influence what’s new, now and next in music and audio.\u003c/p\u003e\n\u003cp\u003eWe are looking for Security engineers to join our growing technology organisation!\u003c/p\u003e\n\u003cp\u003eAs Security engineers at SoundCloud, we secure the infrastructure for products that music listeners and creators love. Our work often involves large-scale distributed systems, parallel computing, and data science. We actively improve our tools and processes to support collaboration and productivity. We cultivate an environment where we can all learn and grow.\u003c/p\u003e\n\u003cp\u003eYou have solid backend engineering skills and are motivated to work in these areas. You’re proactive and have experience collaborating closely with other teams. You have experience in application security. You enjoy crafting simple solutions to complex engineering problems and are able to communicate them to product managers. You’re an independent thinker, but thrive in a tight-knit team. You’re committed to the products you work on.\u003c/p\u003e\n\u003cp\u003eIf this describes you, we’d love to chat!\u003c/p\u003e\n\u003cp\u003ePrior experience with microservices, JVM languages, automated testing, and continuous delivery are all highly valued. Ruby and Go is the main language we use, so you are either already proficient in it or excited to learn. Knowledge of Scala is a plus. Experience in technologies such as Hadoop, Spark, Kafka, and data processing pipelines also is a plus.\u003c/p\u003e\n\u003cp\u003eAbout Us:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe’re international! We operate in the US, Berlin and London and all of our communication is in English.\u003c/li\u003e\n\u003cli\u003eWe have a flexible, friendly and inclusive office environment in Mitte\u003c/li\u003e\n\u003cli\u003eOur environment is a learning one, with specific focus on development, including a professional development allowance and a possibility to use 20% of your time for a personal project.\u003c/li\u003e\n\u003cli\u003eYou can contribute to our Engineering Blog post.\u003c/li\u003e\n\u003cli\u003eNot located in Berlin? No worries, we offer extensive relocation support including allowances, one way flights, temporary accommodation and, by partnering with Expath, on the ground support on arrival.\nInterested in a gym membership, photography course or book? We have a Creativity and wellness benefit!\u003c/li\u003e\n\u003cli\u003eWe offer free German courses in office at beginning, intermediate and advanced.\u003c/li\u003e\n\u003cli\u003eLunch twice a week, plus countless snacks and goodies!\u003c/li\u003e\n\u003cli\u003eDiversity at SoundCloud:\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eSoundCloud is for everyone. Diversity and open expression are fundamental to our organization; they help us build a social platform and global community where anyone can create, discover, and share sounds. We acknowledge the challenges in our industry, and strive to develop an inclusive culture where everyone can contribute.\u003c/em\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply via this link: \u003ca href=\"https://jobs.soundcloud.com/job?gh_jid=4309909002\"\u003ehttps://jobs.soundcloud.com/job?gh_jid=4309909002\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazU4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ed076f81ad60623d2d3049b75611b294d16e5a7c/sc-logo-horizontal-orange.png"
  },
  {
    "id": "ea94c57c-d0a1-11e8-9676-0d02532e57f6",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/ea94c57c-d0a1-11e8-9676-0d02532e57f6",
    "created_at": "Fri Nov 16 20:14:47 UTC 2018",
    "company": "Analytics Fire",
    "company_url": "http://analyticsfire.com",
    "location": "North America",
    "title": "Solutions Architect - IoT/Python/React (US/Canada)",
    "description": "\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire builds custom data analytics software for the solar power industry. We’re looking for a hands-on Solutions Architect to help us scale our execution to support additional new high-tech sectors.\u003c/p\u003e\n\u003cp\u003eAnalytics Fire is a deeply technical engineering organization. Most of us are software engineers and spend the majority of our time on heads down engineering activities like coding. Our goal in creating this position is to expand our small client-facing team with a unique person that has both the personality and the technical skill set to collaborate directly with clients and senior members of the technical team in order to help steer technical decision making and requirements gathering, especially early in the project lifecycle.\u003c/p\u003e\n\u003cp\u003eThis position is similar to that of a technical Program Manager, but you will be much more involved in the technical details and hurdles around software deployments and releases than a traditional Project Manager would be. Our ideal candidate is a current or former embedded Software Engineer, full stack Software Engineer, or Data Engineer that has been previously trained as a Program Manager or is willing to be trained in formal Program Management processes.\u003c/p\u003e\n\u003cp\u003eAs a small company, Analytics Fire is able to tailor roles around the strengths of our individual team members. We will tailor this role to your specific technical background. However, it is a hard requirement that you are able to support the following 3 types of responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(a) Represent Analytics Fire software engineering teams in client-facing interactions (and sometimes interactions with potential clients)\u003c/li\u003e\n\u003cli\u003e(b) Technical writing responsibilities such as documenting requirements, project plans, system architecture, etc.\u003c/li\u003e\n\u003cli\u003e(c) Making meaningful contributions to the execution of complex software projects.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor reference, here is a list of some technologies we are currently actively using on a day-to-day basis:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFront-end: JavaScript / React / Angular\u003c/li\u003e\n\u003cli\u003eBack-end: Ruby / Python / Node.js\u003c/li\u003e\n\u003cli\u003eEmbedded: Embedded Linux, Yocto, C, MQTT\u003c/li\u003e\n\u003cli\u003eCV: OpenCV, PCL, object identification and tracking\u003c/li\u003e\n\u003cli\u003eML: TensorFlow, OpenCV, adaptive parametric modeling, ADTs, N-Dimensional Transforms\u003c/li\u003e\n\u003cli\u003eModern software techniques: RESTful APIs, SOA, PaaS, etc\u003c/li\u003e\n\u003cli\u003eAgile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc\u003c/li\u003e\n\u003cli\u003eOther technologies we are currently building with: AWS, GCP, Salesforce platform, ARKit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour primary responsibility will be to assist in guiding new projects through sales, planning, development, and deployment. This will be accomplished through a combination of client interactions, technical writing, and participation in formal sales, program management, and engineering related processes. Your contributions will naturally be slightly front-loaded towards the sales and planning phases, however you will remain deeply connected to each project through the entire lifecycle in order to ensure conceptual integrity is maintained from design to final implementation.\u003c/p\u003e\n\u003cp\u003eThis is a remote position but is only open to candidates living in the US or Canada. We’re flexible about location and hours. We’re a really great match for candidate who wants to work hard on interesting projects, while also having flexibility around time and geography.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSkills \u0026amp; Requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Must have” requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years relevant hands-on experience as an embedded Software Engineer, full stack Software Engineer, or Data Engineer, ideally within a commercial startup environment.\u003c/li\u003e\n\u003cli\u003eFluency around current modern best practices around software development, data engineering, and DevOps.\u003c/li\u003e\n\u003cli\u003eSoft skills necessary to navigate and negotiate with multiple teams, both internal and external to Analytics Fire.\u003c/li\u003e\n\u003cli\u003eAbility and willingness to familiarize yourself with our technical stack.\u003c/li\u003e\n\u003cli\u003eSuperior organization and detail orientation.\u003c/li\u003e\n\u003cli\u003eExcellent written and verbal communication skills.\u003c/li\u003e\n\u003cli\u003eWillingness to design, document, and evangelize new engineering processes to meet evolving organizational requirements.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e“Nice to have” requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFormer work experience or training as a technical Program Management.\u003c/li\u003e\n\u003cli\u003eDeep technical experience with C, Python, or ReactJS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Analytics Fire\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.\u003c/p\u003e\n\u003cp\u003e“We founded Analytics Fire to create the engineering department that we always dreamed of working for. To us that means being able to spend our time working on interesting technical problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:join-us@analyticsfire.com\"\u003ejoin-us@analyticsfire.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b27fcb2989980ffe97f523d96c3b02c68b72a096/bd4a117a-d891-43d1-ba57-e24930cd01ab"
  },
  {
    "id": "0e46406e-d0a1-11e8-828b-ee6df9cc51d4",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/0e46406e-d0a1-11e8-828b-ee6df9cc51d4",
    "created_at": "Fri Nov 16 20:13:18 UTC 2018",
    "company": "Analytics Fire",
    "company_url": "http://analyticsfire.com",
    "location": "North America",
    "title": "Release Manager - IoT/Python/React (US/Canada)",
    "description": "\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire builds custom data analytics software for the solar power industry. We’re looking for a hands-on Release Manager to help us scale our execution to support additional new high-tech sectors.\u003c/p\u003e\n\u003cp\u003eAnalytics Fire is a deeply technical engineering organization. Our goal in creating this position is to expand our small client-facing team with a unique person that has both the technical skillset and the personality to maintain highly coordinated relationships with key internal and client-side stakeholders in order to help proactively guide projects through planning, development, deployment, release, and DevOps.\u003c/p\u003e\n\u003cp\u003eThis position is similar to that of a technical Program Manager, but you will be much more involved in the technical details and hurdles around software deployments and releases than a traditional Project Manager would be. Our ideal candidate is a current or former embedded Software Engineer, full stack Software Engineer, or Data Engineer that has been previously trained as a Program Manager or is willing to be trained in formal Program Management processes.\u003c/p\u003e\n\u003cp\u003eAs a small company, Analytics Fire is able to tailor roles around the strengths of our individual team members. We will tailor this role to your specific technical background and skill set    . However, ability to support client-facing interactions (clarifying requirements, negotiating technical approaches, reporting on status, etc) as well as make meaningful internal contributions in a highly technical environment is a hard requirement.\u003c/p\u003e\n\u003cp\u003eFor reference, here is a list of some technologies we are currently actively using on a day-to-day basis:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFront-end: JavaScript / React / Angular\u003c/li\u003e\n\u003cli\u003eBack-end: Ruby / Python / Node.js\u003c/li\u003e\n\u003cli\u003eEmbedded: Embedded Linux, Yocto, C, MQTT\u003c/li\u003e\n\u003cli\u003eCV: OpenCV, PCL, object identification and tracking\u003c/li\u003e\n\u003cli\u003eML: TensorFlow, OpenCV, adaptive parametric modeling, ADTs, N-Dimensional Transforms\u003c/li\u003e\n\u003cli\u003eModern software techniques: RESTful APIs, SOA, PaaS, etc\u003c/li\u003e\n\u003cli\u003eAgile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc\u003c/li\u003e\n\u003cli\u003eOther technologies we are currently building with: AWS, GCP, Salesforce platform, ARKit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDescription of responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop and maintain well-coordinated relationships with key internal and client-side stakeholders to help drive decision making around production software releases, data engineering, and DevOps.\u003c/li\u003e\n\u003cli\u003eParticipate in collaborative planning discussions and technical decision making early in the project lifecycle to ensure that key decisions are made with reliability, testability, and maintenance in mind.\u003c/li\u003e\n\u003cli\u003eMonitor and oversee coordination, integration, flow of development, testing, and deployment around multiple parallel projects and threads of engineering execution.\u003c/li\u003e\n\u003cli\u003eDrive planning and delivery of high quality software releases: Manage change control process during releases, Continuously improve company release processes, Proactively identify and mitigate risks and remove obstacles to releases\u003c/li\u003e\n\u003cli\u003ePersonally plan and lead the team through our most important software releases. Advise and support the team so that they can take on less critical releases on a day-to-day basis.\u003c/li\u003e\n\u003cli\u003eContinually integrate the QA team and testing engineers into both the requirements gathering and software development processes and report status to clients on a very frequent basis.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is a remote position but is only open to candidates living in the US or Canada. (Note: we may be open to US or Canadian citizens living abroad in US-overlapping time zones on a case by case basis.) We’re flexible about location and hours. We’re a really great match for candidate who wants to work hard on interesting projects, while also having flexibility around time and geography.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSkills \u0026amp; Requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Must have” requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoft skills necessary to develop and maintain well-coordinated relationships with key internal and client-side stakeholders to help drive decision making around production software releases, data engineering, and DevOps.\u003c/li\u003e\n\u003cli\u003e3+ years hands experience as an embedded Software Engineer, full stack Software Engineer, or Data Engineer, ideally within a commercial startup environment.\u003c/li\u003e\n\u003cli\u003eFamiliarity with current modern best practices around software development, data engineering, and DevOps\u003c/li\u003e\n\u003cli\u003eAbility and willingness to familiarize yourself with the specific technical stacks that we use.\u003c/li\u003e\n\u003cli\u003eSuperior organization and detail orientation.\u003c/li\u003e\n\u003cli\u003eExcellent written and verbal communication skills.\u003c/li\u003e\n\u003cli\u003eWillingness to design, document, and evangelize new engineering processes to meet evolving organizational requirements.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e“Nice to have” requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHands-on technical experience writing code in C, C++, Python, ReactJS\u003c/li\u003e\n\u003cli\u003ePrevious experience as a technical Program Manager.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Analytics Fire\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.\u003c/p\u003e\n\u003cp\u003e“We founded Analytics Fire to create the engineering department that we always dreamed of working for. To us that means being able to spend our time working on interesting technical problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:join-us@analyticsfire.com\"\u003ejoin-us@analyticsfire.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--84c33b065f8858b28e9e161159f1d7f0a1333cd7/5c0bda92-4866-495d-a81e-7dd119cfae7b"
  },
  {
    "id": "b0248344-89e5-11e8-87e5-7d6aa5fe3ed0",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/b0248344-89e5-11e8-87e5-7d6aa5fe3ed0",
    "created_at": "Fri Nov 16 16:34:22 UTC 2018",
    "company": "SunteckTTS",
    "company_url": null,
    "location": "Jacksonville, FL (Or Remote)",
    "title": "Sr PHP Developer (Full-stack)",
    "description": "\u003cp\u003eRequirements:\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003eNice to Haves:\u003c/p\u003e\n\n\n\n\n\n\n\n\n\u003cp\u003eAbout the Role: \u003c/p\u003e\n\u003cp\u003eYou will be responsible for contributing to the technical design, development, and implementation of the SunteckTTS application ecosystem. The role involves more than just writing production code; in a typical week, you could be: brainstorming technical architecture options, providing feedback to improve our development processes, reviewing PRs from other team members, fixing a bug you randomly came across, or improving unit test coverage.\u003c/p\u003e\n\u003cp\u003eWe’re looking for an outstanding Senior Developer with a desire to participate in a growing team with the skills, experience, and understanding to join a small, but strong development team. In order to meet the many challenges and high volume work of the SunteckTTS users, it is important for the Senior Developer to have excellent communication.\u003c/p\u003e\n\u003cp\u003eAbout SunteckTTS and the Team:\u003c/p\u003e\n\u003cp\u003eSunteckTTS is an industry-leading, full-service, transportation logistics provider that operates through a network of sales, operations, and capacity specialists. We are a billion dollar company with over 200 independently owned and operated agent offices across the U.S. and Canada.\nWe focus on providing asset and non-asset surface transportation to a wide range of end-use markets, including food, lumber, paper, printing, textiles, electronics, machinery, government, and more. The Application Development Group is in the midst of an ambitious program to create best in breed software products and improve existing systems for our user base. Our team of Business Analysts and Developers share a culture of self-ownership and open communication to provide\nmaximum business value. We strive to ensure team-based component ownership, development, and quality assurance. We are a tight knit group that relies on ability and flexibility to ensure we balance our strides towards improved process and need to meet the priorities of a heavily used\nenterprise system. The Application Development Group focuses on a culture of open communication, learning, and transparency.\u003c/p\u003e\n\u003cp\u003eSunteckTTS is an Equal Opportunity Employer and does not discriminate against qualified applicants with regard to race, color, religion, age, sex, national origin, handicap, sexual orientation or veteran status.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail your resume to:\n\u003ca href=\"mailto:anthony.vargas@suntecktts.com\"\u003eanthony.vargas@suntecktts.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzlYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0538ec284289af7dbfceb09ccf27499bfa17aed3/823b3a50-63ca-4309-85b4-9ab437ebd949"
  },
  {
    "id": "2744c836-e97b-11e8-8236-5be6ba23f176",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/2744c836-e97b-11e8-8236-5be6ba23f176",
    "created_at": "Fri Nov 16 08:41:52 UTC 2018",
    "company": "Piktochart Sdn Bhd",
    "company_url": null,
    "location": "Europe",
    "title": "DevOps (Remote - Europe)",
    "description": "\u003cp\u003eDear server/database admin, you’ve arrived at the opening where challenge meets excitement. Piktochart is a growing startup and we work to serve our users so that they can create infographics on a daily basis with ease. If you have a strong passion for scaling web apps and application security, we need your help on our server operations!\u003c/p\u003e\n\u003cp\u003eYour mission:\u003c/p\u003e\n\u003cp\u003eDesign scalable and secure web infrastructure on GCP \u0026amp; AWS clouds\nMonitor system and network health\nDeploy containerized applications on Kubernetes\nAnalyze software performance and perform system/code optimization\nDesign and scale database systems\nAutomate server management using tools like Ansible or Saltstack\nParticipate in service capacity planning and demand forecasting\u003c/p\u003e\n\u003cp\u003eYou offer :\u003c/p\u003e\n\u003cp\u003e3+ years experience with distributed Unix/Linux environments, preferably Ubuntu or Debian\nFamiliarity with Amazon and Google clouds\nExperience with Docker and container orchestration platforms\nExperience with scaling MySQL, PostgreSQL, Redis and Memcached clusters\nFamiliar with Ruby on Rails web framework\nStrong knowledge of web application security\nBash and Python scripting\nKnowledge of Nginx, HAProxy\nKnowledge of Ansible / Chef / Puppet\nKnowledge of Elasticsearch stack\u003c/p\u003e\n\u003cp\u003eExtra points if you have:\u003c/p\u003e\n\u003cp\u003eExperience with CI services, CircleCI / Jenkins\nExperience with Golang, Nodejs\nExperience with Agile practices (Scrum, Kanban)\nKnowledge of Nagios / Statd / Graphite\nHigh self-learning ability to adapt to emergency circumstances\nAbility to manage multiple issues at once and keep your team updated on what's going on\nKnowledge in backup/restore operations\u003c/p\u003e\n\u003cp\u003eLocation :\u003c/p\u003e\n\u003cp\u003eRemote (Already based in Europe or willing to work in EU timezone)\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply here : \u003ca href=\"https://grnh.se/e0769a2c1\"\u003ehttps://grnh.se/e0769a2c1\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a77c2ed67ba70e15837e957c69e76a6c6af641ac/aa062216-a41a-4c15-a18d-c5082cace137"
  },
  {
    "id": "b99f4c2c-e94b-11e8-8abf-17c73d6427e2",
    "type": "remote",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/b99f4c2c-e94b-11e8-8abf-17c73d6427e2",
    "created_at": "Fri Nov 16 03:01:16 UTC 2018",
    "company": "Ikayzo",
    "company_url": "http://ikayzo.com",
    "location": "Vancouver (remote)",
    "title": "Senior Software Engineer - Ruby on Rails / React ",
    "description": "\u003cp\u003e\u003cstrong\u003eRemote position for Vancouver, BC residents\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://ikayzo.com\"\u003eIkayzo\u003c/a\u003e, a boutique software development firm based in Honolulu, is looking for experienced Ruby on Rails developers with strong React skills capable of taking complex projects from ideation to release. In this role he / she will be responsible for building high quality, secure and scalable web applications in the finance / fintech space. Our customers include industry leading software firms, renewable energy companies and financial institutions.\u003c/p\u003e\n\u003cp\u003ePlease provide your GitHub profile or another work example reference in your resume.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA solid grounding in OO software architecture / design patterns\u003c/li\u003e\n\u003cli\u003eA pragmatic approach focused on delivering on-time while maintaining quality\u003c/li\u003e\n\u003cli\u003eExperience designing and implementing successful non-trivial enterprise Ruby on Rails projects (5+ years)\u003c/li\u003e\n\u003cli\u003eExperience with ReactJS (Reflux or Redux)\u003c/li\u003e\n\u003cli\u003eExperience with agile development methodologies\u003c/li\u003e\n\u003cli\u003eComfort with Git Feature Branch Workflow and the ability to incorporate PR feedback quickly\u003c/li\u003e\n\u003cli\u003eFirm grasp of data modeling\u003c/li\u003e\n\u003cli\u003eA passion for software development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eNote: Specialized finance domain knowledge is not required but successful applicants must be able to quickly understand complex business rules and calculations.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eWe are not accepting applications from recruiters for this position.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eSend resumes to \u003ca href=\"mailto:career@ikayzo.com\"\u003ecareer@ikayzo.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fe74b61172b5e2551482923d6459b31814afbde1/a4dc87ba-891e-4dc3-a3e8-30201cbdbacc"
  },
  {
    "id": "47328346-e90c-11e8-9429-c09930ae6ec9",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/47328346-e90c-11e8-9429-c09930ae6ec9",
    "created_at": "Thu Nov 15 19:26:24 UTC 2018",
    "company": "Acadian Asset Management",
    "company_url": "http://acadian-asset.com",
    "location": "Boston, MA",
    "title": "Full Stack Developer \u0026 Senior Analyst (Investment Analytics)",
    "description": "\u003cp\u003ePosition Overview:\nWe are seeking an experienced Software Engineer to help us design and build Acadian’s advanced browser-based, interactive, analytical platform that helps us better understand, explain, and improve our quantitative investment process. This is a hands-on, full-stack development role that provides growth and learning opportunities. The Software Engineer will utilize and hone a variety of technical skills while gaining and applying quantitative investment knowledge. Our small team is embedded within the investment group, providing the opportunity to see your work in action. Join us to leverage your software development skills and work with world class technology and investment experts.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, build, test, and support multi-tiered distributed, clustered, web-based applications and platforms\u003c/li\u003e\n\u003cli\u003eEngineer, design, and build scalable, interactive, responsive, informative, and beautiful data visualization and exploration tools\u003c/li\u003e\n\u003cli\u003eTeam up with quantitative portfolio managers and researchers to develop and execute process improvement initiatives through software development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience building browser-based applications using JavaScript, CSS, and HTML\u003c/li\u003e\n\u003cli\u003eExperience programming using a server-side scripting language such as Python (Node, Ruby, Julia, etc.)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent knowledge and technical work experience\u003c/li\u003e\n\u003cli\u003eHands on experience running http server such as Apache / NGINX\u003c/li\u003e\n\u003cli\u003ePrior investment/financial industry knowledge is not required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOther technologies we use:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSQL, NoSQL, MongoDB, Redis\u003c/li\u003e\n\u003cli\u003eNumpy, Scipy, Pandas\u003c/li\u003e\n\u003cli\u003eD3, AngularJS, Node\u003c/li\u003e\n\u003cli\u003eDocker, Slurm, ZeroMQ, AWS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt is the policy of Acadian Asset Management LLC to provide equal employment opportunity to all qualified persons without regard to race, creed, color, sex, age, national origin, marital status, veteran status, citizenship status, disability, or sexual orientation.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://www.acadian-asset.com/careers\"\u003ehttps://www.acadian-asset.com/careers\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTlXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--703f54fc6dc8eda27790b08f4867a4593f252f09/e875225d-b3cc-454b-9e2f-a7e80cdb65fa"
  },
  {
    "id": "76fcadae-e84e-11e8-88fc-96a168773892",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/76fcadae-e84e-11e8-88fc-96a168773892",
    "created_at": "Wed Nov 14 20:50:03 UTC 2018",
    "company": "NBCUniversal",
    "company_url": "https://www.nbcunicareers.com/",
    "location": "Universal City, CA",
    "title": "Media Software Engineer",
    "description": "\u003cp\u003eResponsibilities :\u003c/p\u003e\n\u003cp\u003eCoding at the component level and works under minimal supervision.\nAsset Management System Administration with systems, applications and service integrations.\nProvide proactive, regular, and professional-level communication with clients and team members alike\nManage system integration with 3rd party providers.\nProvide usage reports and track key metrics as required.\nEnsure delivered solutions enable the organization to manage the asset portfolio with respect to risk, cost, control, governance, compliance and business performance objectives\nCollaborate with stakeholders, developers, and system teams to design and maintain automation and deployment tools\nAssist project and technology teams in troubleshooting systems\nCreate dashboards and other tools for Project, Operations and Engineering teams to use in day-to-day monitoring and troubleshooting and enhance operational transparency within business units\nFollow Security Best Practices\nOccasional after hour support based on upgrades, new deployments and high-profile campaigns and/or market critical events.\u003c/p\u003e\n\u003cp\u003eJob Requirements\u003c/p\u003e\n\u003cp\u003eKnowledge/experience in relevant technologies, such as:\nXML Scripting\nJava/JavaScript\nJSON Messaging\nHTTP Protocol\nWeb Services (SOAP \u0026amp; REST)\nPython, Ruby, Perl, and Smalltalk or other scripting languages preferred\nFamiliarity with ELK Stack (Prometheus) preferred\nAmazon Web Services technologies experience preferred\nAsset Management Systems\nSolid interpersonal skills with the ability to communicate and present to all levels of the organization and with external parties\nSelf-directed, highly motivated individual who can effectively manage multiple activities, pay attention to detail and a focus on continuous improvement.\nHigh degree of professionalism\u003c/p\u003e\n\u003cp\u003eDesired Characteristics\u003c/p\u003e\n\u003cp\u003eScope of activities within projects include:\nBusiness requirements, documentation \u0026amp; gap analysis\nCoordination of connectivity setup\nTechnical implementation/provisioning\nDevelop test plans, procedures and scripting for new workflows, integration and automated UI testing\nUnderstand Process flow and data mapping\nData preparation, deployment and analysis\nWeb services development\nApplication knowledge: Orchestration tools, Workflow Engines, Search Engines, BPM and transcoding.\nDatabase experience and network administration\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eIf interested, please apply here: \u003ca href=\"https://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\"\u003ehttps://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "cb1e9170-e832-11e8-8c0b-1d1828cf3aff",
    "type": "remote",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/cb1e9170-e832-11e8-8c0b-1d1828cf3aff",
    "created_at": "Wed Nov 14 17:30:09 UTC 2018",
    "company": "Cobot",
    "company_url": "http://cobot.me",
    "location": "Berlin, Germany",
    "title": "Backend Developer Ruby/Elixir",
    "description": "\u003cp\u003eYou are looking to put your skills to use in a fast-moving product used by thousands of people every day? \u003cstrong\u003eYou care about maintainable, tested, well-documented code, consistency and technical excellence, while always putting the user’s needs first?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a developer focused on backend who is excited to work within an \u003cstrong\u003einternational and welcoming team\u003c/strong\u003e of backend developers, frontend developers, and support engineers to build and maintain a fast and robust codebase for Cobot.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCobot is a management platform for coworking spaces. Our app helps coworking spaces around the world to automate their operations so that they can focus on what matters most: building communities and welcoming workspaces.\u003c/strong\u003e Coworking spaces from New Delhi to San Francisco use us to manage their members, collect payments, book conference rooms, and more. Our customers range from small creative spaces with only a few members to huge business accelerators with thousands of people. We’re a bootstrapped company, operating since 2006 out of Berlin Kreuzberg. We’re a team of 15 people, meaning lots of opportunity for you to actively shape the product, and contribute to the success of the team in a very direct way.\u003c/p\u003e\n\u003cp\u003eOur technology stack is evolving all the time. Our backend is 90% Ruby/Rails, and we recently started to use Elixir. Our frontend is server generated HTML or Ember.JS. As databases, we use CouchDB, Postgres, DynamoDB. We deploy to AWS and Heroku.\u003c/p\u003e\n\u003cp\u003eOur team values working at a healthy pace and a normal working day over working long hours late into the night. We foster a culture of continuous improvement and learning. Making mistakes is part of what we do, and we make sure we have each other’s backs and learn from them.\u003c/p\u003e\n\u003cp\u003eWe value diversity in all aspects of our team. We value everyone’s questions, insights and feedback.\u003c/p\u003e\n\u003cp\u003eThis is a permanent, employed full-time position in Berlin.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://cobot.workable.com/j/CE9189A9C9\"\u003eRead on\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://cobot.workable.com/j/CE9189A9C9\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3RXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--596ac329ee8f03d221fe26add5a4ef67dd172bfa/b1d4b584-1e58-476c-85bd-4997962d599e"
  },
  {
    "id": "dc5e367e-e74d-11e8-83b6-bff5f2b12e4f",
    "type": "remote",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/dc5e367e-e74d-11e8-83b6-bff5f2b12e4f",
    "created_at": "Tue Nov 13 14:11:38 UTC 2018",
    "company": "VONQ",
    "company_url": "http://www.vonq.com",
    "location": "Rotterdam",
    "title": "DevOps Engineer",
    "description": "\u003cp\u003eYou are a DevOps or System Engineer who can’t wait to be part of a growing team and to make actual impact. At VONQ we do cool stuff, like building a flagship product, tools and APIs that serve global customers. Are you ready to get your hands dirty in the design, implementation and testing of various infrastructure services that are used by our development teams? Apply at VONQ for DevOps Engineer in Rotterdam!\u003c/p\u003e\n\u003cp\u003eDevOps Engineer\nRotterdam, fulltime, ASAP\u003c/p\u003e\n\u003cp\u003eBe part of our journey and bring our development process, infrastructure and engineering practices to the next level\nAs our System Engineer you will be the one leading critical platform development efforts. What you’ll actually be contributing to? Our core product, the Job Marketing Platform (JMP). It’s a data-driven application with a recommendation engine that is advising recruiters how they should reach their target audience online.\u003c/p\u003e\n\u003cp\u003eWe have an ambitious roadmap for the upcoming period. Your part in the process? We will start to utilise a number of various DevOps practices - and that’s where you come in!\u003c/p\u003e\n\u003cp\u003eYou will be part of an international and experienced Engineering department consisting of Backend and Frontend Developers, Data Engineers, an Agile Coach and a CTO.\u003c/p\u003e\n\u003cp\u003eYour day-to-day job in a nutshell as VONQ’s DevOps Engineer\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMake fully functional environments available on demand for the development team\nProvide guidance and support on application architecture as we move to a container based architecture\u003c/li\u003e\n\u003cli\u003eEnsure a smooth flow of work for all of our development teams\u003c/li\u003e\n\u003cli\u003eEnable fast clear feedback for our development team (and the wider business) on application changes, by providing clear logging, metrics and supporting the team's automated testing infrastructure\u003c/li\u003e\n\u003cli\u003eYou'll work autonomously to make our architectural and business goals a reality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eGreat understanding of DevOps practices and an Agile mindset, that is you!\nThis describes the ideal candidate, but above all we value people that are eager to grow, autonomous, work together, and love to get things done! Furthermore we think you need:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years relevant experience\u003c/li\u003e\n\u003cli\u003eExcellent communication skills in English\u003c/li\u003e\n\u003cli\u003eExperience working in application development, systems or IT operations\u003c/li\u003e\n\u003cli\u003eExperience with Cloud and container technologies (e.g. AWS, docker, rocket)\u003c/li\u003e\n\u003cli\u003eGreat understanding DevOps practices and why to use them (e.g. CI,CD, Infrastructure as code, automated testing)\u003c/li\u003e\n\u003cli\u003eYou can develop an array of tools using various programming languages (e.g. Golang, Python, PHP, Scala)\u003c/li\u003e\n\u003cli\u003eExperience with at least some of our middleware and databases: NGINX, Elasticsearch, RabbitMQ, MySQL, Mongo\u003c/li\u003e\n\u003cli\u003eExperience in contributing to the systems architecture of a company\u003c/li\u003e\n\u003cli\u003eLast but not least, you are not afraid to get your hands dirty on older infrastructure, to maintain it and migrate it to the new environment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points!\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with application development (e.g. PHP, Scala, Ruby, Golang)\u003c/li\u003e\n\u003cli\u003eExperience with data engineering (e.g. spark, scala, databricks)\u003c/li\u003e\n\u003cli\u003eWorked as part of a distributed (or international) team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is why you should join our team\nWe promise that at VONQ you’ll never stop learning! You’ll be surrounded by international and experienced colleagues, so prepare yourself for some interesting and intellectual conversations.\nOur product has still a lot of potential to grow, and YOU can make impact on that. You’ll get freedom and space for own initiatives, in fact, we encourage you!\u003c/p\u003e\n\u003cp\u003eWe have legendary company outing, beers on Friday and lots of FUN!\u003c/p\u003e\n\u003cp\u003eThere is more! We offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA good salary and 8% holiday allowance\u003c/li\u003e\n\u003cli\u003e100% commuting expenses compensation\u003c/li\u003e\n\u003cli\u003ePension contribution\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eUnlimited (paid!) holidays\u003c/li\u003e\n\u003cli\u003eTime and budget for training\u003c/li\u003e\n\u003cli\u003eRelocation support, and more!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eUp for the challenge? Join VONQ as System Engineer and make things happen! Please apply by using this application link\n. Questions? Contact Sarah (Recruiter) -\u0026gt; sarahellithy(at)vonq.com.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply by using this application link\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--42ef9e87e92144f85a34863593358a683954179e/d08b7e6a-0293-4795-9808-a6b527efd7da"
  },
  {
    "id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0",
    "created_at": "Fri Nov 09 14:51:11 UTC 2018",
    "company": "New York University",
    "company_url": null,
    "location": "New York, New York 10001",
    "title": "Technology Solutions Developer",
    "description": "\u003cp\u003eAs a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.\u003c/p\u003e\n\u003cp\u003eUS\u003c/p\u003e\n\u003cp\u003eThe Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.\u003c/p\u003e\n\u003cp\u003eOur group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.\u003c/p\u003e\n\u003cp\u003eYOU\u003c/p\u003e\n\u003cp\u003eWe're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!\u003c/p\u003e\n\u003cp\u003eWHY\u003c/p\u003e\n\u003cp\u003eAs an employee of NYU Law, you would receive NYU's benefits (\u003ca href=\"https://www.nyu.edu/employees/benefit.html\"\u003ehttps://www.nyu.edu/employees/benefit.html\u003c/a\u003e), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.\u003c/p\u003e\n\u003cp\u003eRequired Education:\nBachelor's degree.\u003c/p\u003e\n\u003cp\u003eRequired Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.\u003c/p\u003e\n\u003cp\u003ePreferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.\u003c/p\u003e\n\u003cp\u003eRequired Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.\u003c/p\u003e\n\u003cp\u003ePreferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)\u003c/p\u003e\n\u003cp\u003eEOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI105491972\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "f61bcf90-e400-11e8-8ff5-71d2e066e687",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/f61bcf90-e400-11e8-8ff5-71d2e066e687",
    "created_at": "Fri Nov 09 09:23:05 UTC 2018",
    "company": "University of Cambridge",
    "company_url": "https://www.gen.cam.ac.uk/",
    "location": "Cambridge, UK",
    "title": "Research Software Engineer",
    "description": "\u003cp\u003e\u003cstrong\u003eResearch Software Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you passionate about open source and making user friendly client-side web applications? We’re a small team comprised of five developers (six, if you join us!) and a biologist, looking for a developer to help us create client-side applications for the open source \u003ca href=\"http://www.intermine.org\"\u003eInterMine\u003c/a\u003e data warehouse platform. Using JavaScript and ClojureScript, the successful applicant will create tools to query and display complex biological data.\u003c/p\u003e\n\u003cp\u003eWe have a lot of fun problems to solve, using the best technologies. How do you let naive users search complex biological data sets? How do you visualise data to let people absorb complicated relationships quickly? How can we use technology to get scientists the answers and data they need? We’re deeply committed to open source and the open science movement. We’re passionate about standards and making scientific data available to everyone.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur Stack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInterMine​ is an open source Java-based data warehouse, integrating biological data in varied formats into a PostgreSQL database. InterMine also includes ​ web services with client libraries​ in R, Python, Perl, Ruby, Java, and JavaScript, and a legacy JSP-based UI. We’ve also developed ​ BlueGenes​ -- our new user interface powered by Clojure. See our current projects on ​\u003ca href=\"https://github.com/intermine/\"\u003eGitHub​\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for an enthusiastic problem solver willing to learn and try new technologies. You’ll be able to show us beautiful interfaces you’ve made. You’ll be comfortable with HTML, CSS, Javascript, and working with the DOM. Note that previous experience with Clojure and / or biology is not required. However an interest and willingness to learn is!\u003c/p\u003e\n\u003cp\u003ePlease see the \u003ca href=\"http://www.jobs.cam.ac.uk/job/19504/\"\u003ejob advert\u003c/a\u003e for specific details.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat We Offer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a member of a small team, you’ll have the chance to learn and extend your skills significantly. Opportunities include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003einteracting with a ​ worldwide community of open-source contributors​ .\u003c/li\u003e\n\u003cli\u003ementoring students through programs such as ​ Google Summer of Code​ .\u003c/li\u003e\n\u003cli\u003euser testing your applications, both in person and via video conferencing.\u003c/li\u003e\n\u003cli\u003epresenting/co-authoring academic papers, posters, and talks at technical and\nacademic conferences.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe offer very competitive salaries and a generous benefits package (see\n\u003ca href=\"http://www.jobs.cam.ac.uk/offer%E2%80%8B\"\u003ehttp://www.jobs.cam.ac.uk/offer​\u003c/a\u003e for the full list).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e33 days annual holiday\u003c/li\u003e\n\u003cli\u003e37.5 hour work week\u003c/li\u003e\n\u003cli\u003eUniversity pension\u003c/li\u003e\n\u003cli\u003eChild care and bike to work salary sacrifice schemes\u003c/li\u003e\n\u003cli\u003eAccess to ​ University sports facilities\u003c/li\u003e\n\u003cli\u003eFamily friendly benefits​ like maternity, paternity and parental leave, flexible\nworking and career break schemes.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTo apply: \u003ca href=\"http://www.jobs.cam.ac.uk/job/19504/\"\u003ehttp://www.jobs.cam.ac.uk/job/19504/\u003c/a\u003e\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eTo apply: \u003ca href=\"http://www.jobs.cam.ac.uk/job/19504/\"\u003ehttp://www.jobs.cam.ac.uk/job/19504/\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "b82067ca-e322-11e8-814a-239ee3094eb4",
    "type": "remote",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/b82067ca-e322-11e8-814a-239ee3094eb4",
    "created_at": "Thu Nov 08 15:13:52 UTC 2018",
    "company": "Gatekeeper",
    "company_url": "https://www.gatekeeperhq.com/",
    "location": "Remote",
    "title": "Senior Ruby Developer - Remote",
    "description": "\u003cp\u003e\u003cstrong\u003eThe Role\u003c/strong\u003e\nWe’re looking for a senior backend ruby developer to join our growing experienced and talented technology team. The development team is responsible for all the vital backend infrastructure for our web application, \u003ca href=\"https://www.gatekeeperhq.com/\"\u003eGatekeeper\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe develop in Ruby on Rails, so having demonstrable senior experiences of this is essential. You should be capable of working on all aspects of the software development cycle from architecture, coding and testing through to deployment.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDevelopment team\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe're a distributed team of experienced developers\u003c/li\u003e\n\u003cli\u003eWe love Ruby\u003c/li\u003e\n\u003cli\u003eWe know how to cook a Rails monolith in the right way\u003c/li\u003e\n\u003cli\u003eWe do care about the project, about the code quality and about our customers\u003c/li\u003e\n\u003cli\u003eWe use code reviews (reviewing each other)\u003c/li\u003e\n\u003cli\u003eWe have Code to Test Ratio: 1:1.1\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIREMENTS\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRequired skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLoves Ruby\u003c/li\u003e\n\u003cli\u003eStrong Rails knowledge, a good understanding of reliable design for big Rails projects\u003c/li\u003e\n\u003cli\u003eConfident with SQL (PostgreSQL in particular)\u003c/li\u003e\n\u003cli\u003eClean code with an understanding of code smells and refactoring\u003c/li\u003e\n\u003cli\u003eTest-driven development - “Test Obsessed”\u003c/li\u003e\n\u003cli\u003eUnderstanding of front-end development (HTML/HAML/SASS/JS). However, no knowledge of frameworks required.\u003c/li\u003e\n\u003cli\u003eExperience of delivering large development projects\u003c/li\u003e\n\u003cli\u003eTangible contribution to the open-source community or trackable record of public talks\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe need a talent who wants to be a long-term part of our business — not just an employee!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSalary dependent on experience (range $4,000 - $6,500)\u003c/li\u003e\n\u003cli\u003eWork from home\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003e4 weeks paid leave\u003c/li\u003e\n\u003cli\u003eWe’ll pay for you to take any relevant training that improves your value to Gatekeeper\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e$2000 REFERRAL\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDo you know someone that would be eligible for this role? We are offering a $2000 referral reward if you introduce a suitable candidate that we decide to hire.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eSend CODE EXAMPLES and your CV to Mihaela Radu at \u003ca href=\"mailto:mihaela.r@gatekeeperhq.com\"\u003emihaela.r@gatekeeperhq.com\u003c/a\u003e or apply directly here: \u003ca href=\"https://gatekeeper.workable.com/jobs/810060\"\u003ehttps://gatekeeper.workable.com/jobs/810060\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3hXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--98bb3f53733a14cadb93db6b3512f37a3774eeb8/9f0637f8-8115-4a84-9f10-44a5c84d10bd"
  },
  {
    "id": "36bb2228-e201-11e8-9310-b526bfa5a16e",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/36bb2228-e201-11e8-9310-b526bfa5a16e",
    "created_at": "Tue Nov 06 20:19:44 UTC 2018",
    "company": "Cortex Building Intelligence",
    "company_url": "https://cortexintel.com/",
    "location": "New York, NY",
    "title": "Software Engineer, Full Stack (Rails, React)",
    "description": "\u003cp\u003e\u003cstrong\u003eCompany Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCortex is a rapidly growing technology startup.  We provide software for Commercial Real Estate buildings that enables operators to run their buildings with significantly more precision.  This is creating substantial financial savings (up to $850k per year per building), while also having a significant sustainability impact (reducing energy use by 5-10% or the equivalent of taking 850 cars off the road).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Cortex, we are as proud of our pristine codebase as we are of our mission to create more sustainable cities. We accomplish this mission by using IoT data, Machine Learning, and modern web development to transform the way large buildings operate.  We are looking for a talented Software Engineer to work collaboratively with us to deliver amazing product experiences across all of our application’s channels including web, mobile, email and push notifications.  The Engineer in this role will have the opportunity to learn from an experienced team while accelerating their career with both guided and autonomous work.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreating new software product experiences that assist building operators in efficiently and effectively running their buildings by delivering our high impact Machine Learning recommendations through our web, mobile, email, and push notification channels.\u003c/li\u003e\n\u003cli\u003eIntegrating with third-party APIs to import utility company and building management system data to be used to feed our Machine Learning algorithms.\u003c/li\u003e\n\u003cli\u003eWorking closely with our Customer Success team to support client onboarding and operations.\u003c/li\u003e\n\u003cli\u003eTaking ownership of our Internal Tooling needs to allow our Customer Success team to scale their operational support of our clients.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of pragmatic, real-world experience creating, maintaining, testing, and deploying high-quality code to production systems.\u003c/li\u003e\n\u003cli\u003eStrong understanding of web development technologies, OOP languages, and relational databases.  We use Ruby with Rails, JavaScript with React, and Postgres.\u003c/li\u003e\n\u003cli\u003eExperience working with standard software engineering tools and practices such as version control, automated testing, and lightweight project management.  We use Git, RSpec, and Clubhouse.\u003c/li\u003e\n\u003cli\u003eProduct-focused.  Have the ability to understand the needs of our users and translate those needs into prioritized product features.\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills.  Committed, hard-working, and thoughtful.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe usual suspects: Competitive compensation/equity, commuter benefits, and access to Medical, HSA and 401k plans.\u003c/li\u003e\n\u003cli\u003eUnlimited paid time off.\u003c/li\u003e\n\u003cli\u003eYour choice of 13” or 15” Macbook Pro.\u003c/li\u003e\n\u003cli\u003eWork in an environment where clean code, automated testing, constructive code reviews, collaborative whiteboarding, thoughtful design, and easy deployments are considered to be the standard operating procedure.\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eSchedule a time to chat with our CTO, Justin Spradlin: \u003ca href=\"https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\"\u003ehttps://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ac4f10dc2db58c4f6c8bf99265e3afc94e0b305/8711ac77-126b-48d2-8caf-7c50a26ceb93"
  },
  {
    "id": "9636b280-e12a-11e8-819f-7c947fed1ee2",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/9636b280-e12a-11e8-819f-7c947fed1ee2",
    "created_at": "Mon Nov 05 20:22:43 UTC 2018",
    "company": "Homestars",
    "company_url": "http://homestars.com",
    "location": "Toronto",
    "title": "Salesforce Engineer ",
    "description": "\u003cp\u003eWHO WE ARE:\nCanadians spend over $70B annually on their homes - whether it’s major renovations, or small repairs and maintenance work. This journey often starts by finding the right contractor. HomeStars is the leading platform in Canada, helping homeowners with their home renovation needs by allowing them to search our database of companies and hundreds of thousands of reviews. Every month over half a million homeowners visit HomeStars to research and connect with the best rated home professionals near them. Home Professionals advertise on HomeStars to tell their story, and grow their business with highly qualified connections. HomeStars has recently been acquired by ANGI Homeservices Inc., the #1 marketplace in the US for helping homeowners connect with the best home service providers.\u003c/p\u003e\n\u003cp\u003eWHY JOIN US:\nHomeStars is looking to continue to build a positive, winning culture and that starts with hiring great people like you! If you are looking to be work or be a part of organization with an exceptional environment, we want to hear from you!\u003c/p\u003e\n\u003cp\u003ePerks of working at HomeStars:\n-We are growing fast. HomeStars is part of the ANGI Homeservices Inc. family.\u003c/p\u003e\n\u003cp\u003e-Excellent Benefits Package. We want a healthy and productive team.\u003c/p\u003e\n\u003cp\u003e-Company wide social events and team building activities.\u003c/p\u003e\n\u003cp\u003e-December Break. The office is closed the week before New Year’s.\u003c/p\u003e\n\u003cp\u003e-Personal Growth. We seek to provide employees with constructive feedback to foster their career growth.\u003c/p\u003e\n\u003cp\u003e-Beautiful brick \u0026amp; beam office in the heart of the entertainment district in Toronto.\u003c/p\u003e\n\u003cp\u003e-Rec room with lounge, ping pong, darts and foosball.\u003c/p\u003e\n\u003cp\u003eABOUT THE ROLE:\nWe are looking for a Salesforce.com Developer who will drive the implementation of Salesforce and its utilization across our organization. The Salesforce Engineer will manage the technical aspects of Salesforce CRM application.\u003c/p\u003e\n\u003cp\u003eTHE OPPORTUNITY:\n-Work in a fast-paced, agile project environment with small, focused teams.\u003c/p\u003e\n\u003cp\u003e-An opportunity to work on a range of platforms such as: Salesforce, Web Applications, Android, iOS.\u003c/p\u003e\n\u003cp\u003e-Gain hands on experience with the latest technologies.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWork closely with both the Salesforce and Engineering team at HomeStars.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eResponsible for the technical aspects of Salesforce.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e-Develop custom solutions in VisualForce, Apex, Java, AJAX, and other key technologies.\u003c/p\u003e\n\u003cp\u003e-Develop and maintain Visualforce, Apex, and Integration tools to other third party solutions.\u003c/p\u003e\n\u003cp\u003e-Working closely with the other departments in order to respond to user’s questions and issues.\u003c/p\u003e\n\u003cp\u003eREQUIREMENTS:\n-2-3 years of experience with software development (Java and/or C# preferred).\u003c/p\u003e\n\u003cp\u003e-Ability to organize and prioritize responsibilities effectively in order to meet deadlines\u003c/p\u003e\n\u003cp\u003e-Understanding of multiple programming environments and tools.\u003c/p\u003e\n\u003cp\u003e-Experience with Cloud or Saas solutions.\u003c/p\u003e\n\u003cp\u003e-Knowledge of data management, SQL, SOA design principles.\u003c/p\u003e\n\u003cp\u003e-Understanding of Ruby on Rails, NodeJS, JavaScript,HTML, CSS, and JSON, and exposure to REST based web services.\u003c/p\u003e\n\u003cp\u003e-Understanding of the Salesforce platform (Admin/Config, Apex, VisualForce, Triggers, etc.).\u003c/p\u003e\n\u003cp\u003e-Salesforce experience as a developer or end user.\u003c/p\u003e\n\u003cp\u003eBENEFITS:\nWe are an equal opportunity employer and do not discriminate based upon race, religion, colour, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eEmail resume directly to:\n\u003ca href=\"mailto:jessica.chester@homestars.com\"\u003ejessica.chester@homestars.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5cda082695a7f08b5567363aa9531c30e29fe648/3de2fb1b-53e9-414f-b371-b04b36617c7d"
  },
  {
    "id": "cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/cdd3b306-ded1-11e8-9d57-a9ea0396f64e",
    "created_at": "Fri Nov 02 19:02:51 UTC 2018",
    "company": "Jun Group",
    "company_url": "https://www.jungroup.com/",
    "location": "New York, NY",
    "title": "Senior Software Developer, Server-Side Technologies",
    "description": "\u003cp\u003eThe word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.\u003c/p\u003e\n\u003cp\u003eWe are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.\u003c/p\u003e\n\u003cp\u003eWho you are\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks\u003c/li\u003e\n\u003cli\u003eYou want to be part of a small team inside a large company with massive opportunity for growth\u003c/li\u003e\n\u003cli\u003eYou enjoy collaboration with other teams including product, biz dev, and our in-house QA team\u003c/li\u003e\n\u003cli\u003eYou eagerly dig into complex engineering problems\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we do\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWrite scalable back-end and front-end code in JRuby, Java, and JavaScript\u003c/li\u003e\n\u003cli\u003eExperiment with new tech to find the right tool for the job\u003c/li\u003e\n\u003cli\u003eMaintain high code quality through code reviews and automated tests\u003c/li\u003e\n\u003cli\u003eUse Kanban to manage multiple releases per week\n-Participate in and improve Dev Ops for our primary revenue generating applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHow we do it\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRuby/Rails\u003c/li\u003e\n\u003cli\u003eJavaScript (JQuery, AngularJS, Vue.js)\u003c/li\u003e\n\u003cli\u003eIntelliJ IDEA / TeamCity\u003c/li\u003e\n\u003cli\u003eAWS (EC2, EB, RDS)\u003c/li\u003e\n\u003cli\u003eGoogle Cloud (BiqQuery, Dataflow, Cloud Functions)\u003c/li\u003e\n\u003cli\u003eMySQL\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we offer\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA highly competitive compensation package\u003c/li\u003e\n\u003cli\u003e401k with company match\u003c/li\u003e\n\u003cli\u003ePaid vacation, work from home, and sick days\u003c/li\u003e\n\u003cli\u003eAnnual personal development budget to attend a conference of your choice\u003c/li\u003e\n\u003cli\u003eDesignated time to work on the company-related projects you feel strongly about\u003c/li\u003e\n\u003cli\u003eMacbook Pros, dual monitors, and a quiet working space\u003c/li\u003e\n\u003cli\u003eCatered lunch at least once a week\u003c/li\u003e\n\u003cli\u003eMonthly company events\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.\u003c/p\u003e\n\u003cp\u003eTotal compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://grnh.se/06736d9f2\"\u003ehttps://grnh.se/06736d9f2\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--726761e0459b97d7da1749cd58bef48691f6529f/f1729282-ab89-4940-8f76-77e7ad8e1cae"
  },
  {
    "id": "48d5274e-dd45-11e8-8130-eacb3354d656",
    "type": "remote",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656",
    "created_at": "Wed Oct 31 19:45:06 UTC 2018",
    "company": "Traction",
    "company_url": "https://www.tractionco.com/",
    "location": "Sunnyvale, CA ",
    "title": "Lead Full Stack Developer",
    "description": "\u003cp\u003eThe Job:\u003c/p\u003e\n\u003cp\u003eTraction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.\u003c/p\u003e\n\u003cp\u003eThis role will see you leading a team of developers as well as being an individual contributor to the team.\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.\u003c/p\u003e\n\u003cp\u003eMust be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager to ensure requirements and timelines are met\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager and back-end teams to architect and integrate front-end code\u003c/li\u003e\n\u003cli\u003eDevelop advanced applications with a mixture of third-party and proprietary tools and libraries\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a lead developer\u003c/li\u003e\n\u003cli\u003e2+ years of experience building websites using HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)\u003c/li\u003e\n\u003cli\u003e8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.\u003c/li\u003e\n\u003cli\u003e8+ years of experience in modeling n-tier applications\u003c/li\u003e\n\u003cli\u003e6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus\u003c/li\u003e\n\u003cli\u003eExperience writing unit tests for web applications\u003c/li\u003e\n\u003cli\u003eExperience with containers and container platforms (Docker, Mesos, Kubernetes)\u003c/li\u003e\n\u003cli\u003eExperience in defining continuous integration build processes for front-end web development\u003c/li\u003e\n\u003cli\u003eFamiliarity with CI/CD strategy (AWS, Heroku, Google Cloud)/\u003c/li\u003e\n\u003cli\u003eKnowledge of common design patterns in web development (i.e., MVC, MVVM)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of source control software such as Git (preferred) or SVN\u003c/li\u003e\n\u003cli\u003eExposure to Agile project management methodologies\u003c/li\u003e\n\u003cli\u003eAbility to multi-task and manage tasks with varying priorities\u003c/li\u003e\n\u003cli\u003eMust be able to brainstorm and communicate technology ideas and issues with peers and management\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eExperience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies and implement in short time\u003c/li\u003e\n\u003cli\u003eComfortable working in a multi-discipline, geographically dispersed team\u003c/li\u003e\n\u003cli\u003eExperience in leading a team of developers through all processes of development and integration, including test automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation: BA or BS in computer science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtra Credit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with e-commerce\u003c/li\u003e\n\u003cli\u003eKnowledge of accessibility specifications\u003c/li\u003e\n\u003cli\u003eExperience with GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.\u003c/p\u003e\n\u003cp\u003eWill you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\"\u003ehttps://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "690c9fd8-dc37-11e8-9487-4c8007ecf678",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/690c9fd8-dc37-11e8-9487-4c8007ecf678",
    "created_at": "Tue Oct 30 11:32:08 UTC 2018",
    "company": "Clark Germany GmbH",
    "company_url": null,
    "location": "Frankfurt",
    "title": "Senior Software Engineer (m/f)",
    "description": "\u003cp\u003eWho is Clark (\u003ca href=\"http://www.clark.de\"\u003ewww.clark.de\u003c/a\u003e)?\u003c/p\u003e\n\u003cp\u003eSince our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by close to 100.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!\u003c/p\u003e\n\u003cp\u003eAs our Senior Software Engineer, you..\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eplay a central role in the design and development of our backend system and architecture\u003c/li\u003e\n\u003cli\u003eactively contribute to product management and influence our features right from the start\u003c/li\u003e\n\u003cli\u003elift the intelligence of our robo advisor and the efficiency of our insurance operations team\u003c/li\u003e\n\u003cli\u003eclosely interact with colleagues who use your software to service our customers\u003c/li\u003e\n\u003cli\u003econceptualise and deliver features on a platform that will soon serve \u0026gt; 500000 customers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Background, you...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave gained a Technical University or Bachelor's degree\u003c/li\u003e\n\u003cli\u003ehave minimum 4 years experience in software engineering and web development, incl. 2 years Ruby on Rails, as well as other languages\u003c/li\u003e\n\u003cli\u003ea deep understanding of modern software architecture and software design principles, e.g. SOLID, Event Processing, and Domain Driving Design, git, scrum and agile approaches\u003c/li\u003e\n\u003cli\u003etest-driven development and quality assurance through automated testing are selfevident\u003c/li\u003e\n\u003cli\u003egood knowledge of cloud infrastructure and continuous deployment\u003c/li\u003e\n\u003cli\u003eexperience with Javascript Frontend Frameworks especially with Ember are a plus\u003c/li\u003e\n\u003cli\u003eexcellent skills in handling SQL and relational database\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is Clark – this is what we love to offer you:\u003c/p\u003e\n\u003cp\u003ebesides the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\nwe subsidize your job ticket and the company pension scheme.\nwant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\nif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\nif you need to relocate, you have our support.\nyou need to brush up your German? We are offering beginner and advanced German courses!\nyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\nand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch \u0026amp; breakfast as well as our weekly Friday get together.\nThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eHi,\u003c/p\u003e\n\u003cp\u003eto apply please send us, your\u003c/p\u003e\n\u003cp\u003eMotivation Letter, CV \u0026amp; Github Profile\u003c/p\u003e\n\u003cp\u003eYou can apply through our greenhouse page, to get a quick reply:\n\u003ca href=\"https://www.clark.de/de/jobs?gh_jid=4040394002\"\u003ehttps://www.clark.de/de/jobs?gh_jid=4040394002\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eLooking forward to get to know you.\u003c/p\u003e\n\u003cp\u003eCheers, Hanan \u0026amp; Clark Recruitment Team\u003c/p\u003e\n",
    "company_logo": null
  },
  {
    "id": "f3ba7836-dc36-11e8-9e85-eda172fcc718",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/f3ba7836-dc36-11e8-9e85-eda172fcc718",
    "created_at": "Tue Oct 30 11:28:52 UTC 2018",
    "company": "Clark Germany GmbH",
    "company_url": null,
    "location": "Frankfurt",
    "title": "Senior Frontend Developer (m/f)",
    "description": "\u003cp\u003eWho is Clark (\u003ca href=\"http://www.clark.de\"\u003ewww.clark.de\u003c/a\u003e)?\u003c/p\u003e\n\u003cp\u003eSince our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by close to 100.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!\u003c/p\u003e\n\u003cp\u003eAs our Senior Frontend Developer, you..\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eblend concepts of web, mobile, and chat into an awesome user experience\u003c/li\u003e\n\u003cli\u003ework with rockstar designers who deliver you pixel perfect sketch files to get beyond what is imaginable\u003c/li\u003e\n\u003cli\u003einfluence the choice and design of upcoming features by getting involved in product management\u003c/li\u003e\n\u003cli\u003eapply latest frontend technologies to deliver working software\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Background, you...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave gained a Technical University or Bachelor's degree\u003c/li\u003e\n\u003cli\u003ehave minimum 2 years experience in developing Web Applications using modern Frameworks (e.g. Angular, Ember)\u003c/li\u003e\n\u003cli\u003eare strong in applying CSS \u0026amp; SASS, as well as responsive design\u003c/li\u003e\n\u003cli\u003eNice to have: you previously develoeped hybrid mobile apps and have knowledge of android or iOS design guidelines\u003c/li\u003e\n\u003cli\u003eBig plus: having worked with ruby on rails\u003c/li\u003e\n\u003cli\u003ehave a sense for good user experience\u003c/li\u003e\n\u003cli\u003esee transitions and animations as a natural of Web Design\u003c/li\u003e\n\u003cli\u003eare experienced in using content management systems\u003c/li\u003e\n\u003cli\u003ehave a thorough understanding of software design patterns and how to structure larger web applications in Javascript\u003c/li\u003e\n\u003cli\u003eare applying automated UI Testing\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is Clark – this is what we love to offer you:\u003c/p\u003e\n\u003cp\u003ebeside the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\nwe subsidize your job ticket and the company pension scheme.\nwant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\nif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\nif you need to relocate, you have our support.\nyou need to brush up your German? We are offering beginner and advanced German courses!\nyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\nand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch \u0026amp; breakfast as well as our weekly Friday get together.\nThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eHi,\u003c/p\u003e\n\u003cp\u003eto apply please send us, your\u003c/p\u003e\n\u003cp\u003eMotivation Letter, CV \u0026amp; Github Profile\u003c/p\u003e\n\u003cp\u003eYou can apply through our greenhouse page, to get a quick reply: \u003ca href=\"https://www.clark.de/de/jobs?gh_jid=4039724002\"\u003ehttps://www.clark.de/de/jobs?gh_jid=4039724002\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eLooking forward to get to know you.\u003c/p\u003e\n\u003cp\u003eCheers, Hanan \u0026amp; Clark Recruitment Team\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8dcf30dfdbc23ae5192d8953560982236d9fb769/0e3929e7-f54a-4fcc-a72b-7fbc6cbf8f25"
  },
  {
    "id": "3cfd9704-dc36-11e8-90bf-c8a16734ec04",
    "type": "remote",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/3cfd9704-dc36-11e8-90bf-c8a16734ec04",
    "created_at": "Tue Oct 30 11:23:55 UTC 2018",
    "company": "Clark Germany GmbH",
    "company_url": null,
    "location": "Frankfurt",
    "title": "Senior Architect (m/f)",
    "description": "\u003cp\u003eWho is Clark (\u003ca href=\"http://www.clark.de\"\u003ewww.clark.de\u003c/a\u003e)?\u003c/p\u003e\n\u003cp\u003eSince our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by close to 100.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003eAs our Senior Architect (m/f), you..\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ework with engineering managers, product managers, technical leads and other engineers to design, develop and deliver our intelligent consumer insurance platform.\u003c/li\u003e\n\u003cli\u003estay hands on in coding \u0026amp; software development practices by actively contributing to features.\u003c/li\u003e\n\u003cli\u003eensures the logical and systematic conversion of business, customer and product requirements into flexible technical solutions which support current and future needs.\u003c/li\u003e\n\u003cli\u003ecollaborate with cross-functional teams to analyze and decompose complex software systems.\u003c/li\u003e\n\u003cli\u003emaintain up to date documentation of our current architecture and plan our architecture roadmap.\u003c/li\u003e\n\u003cli\u003eplan the migration and subsequent decommissioning of partner systems onto the Clark platform.\u003c/li\u003e\n\u003cli\u003ebring together different perspectives and opinions to come to a common approach.\n \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Background, you...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave minimum 5 years experience in the development of transactional, mission critical applications in heterogeneous environments.\u003c/li\u003e\n\u003cli\u003epragmatic application of UML, BPMN and initial experience of TOGAF or related architecture frameworks.\u003c/li\u003e\n\u003cli\u003eknowledge in Domain Driven Design and Event Driven Architecture is highly desired.\ncloud architecture experience (SaaS, PaaS, IaaS, etc.) incl. containerisation, kubernetes, AWS.\u003c/li\u003e\n\u003cli\u003ein-depth knowledge of design \u0026amp; enterprise integration patterns.\u003c/li\u003e\n\u003cli\u003eindustry expertise in financial services.\u003c/li\u003e\n\u003cli\u003eexperience in product line engineering and software customisation.\u003c/li\u003e\n\u003cli\u003eknowledge of \u0026gt; 3 programming languages, incl. Ruby\n \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is Clark – this is what we love to offer you:\u003c/p\u003e\n\u003cp\u003ebesides the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\ncompetitive Salary\nlearning budget for your personal development\nshares in our Company\nwe subsidize your job ticket and the company pension scheme.\nwant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\nexplore new collaboration models with renowned partners\nif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\nif you need to relocate, you have our support.\nyou need to brush up your German? We are offering beginner and advanced German courses inhouse.\nyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\nand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch \u0026amp; breakfast as well as our weekly Friday get together.\nThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003eHi,\u003c/p\u003e\n\u003cp\u003eto apply please send us, your\u003c/p\u003e\n\u003cp\u003eMotivation Letter, CV \u0026amp; Github Profile\u003c/p\u003e\n\u003cp\u003eYou can apply through our greenhouse page, to get a quick reply: \u003ca href=\"https://www.clark.de/de/jobs?gh_jid=4090598002\"\u003ehttps://www.clark.de/de/jobs?gh_jid=4090598002\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eLooking forward to get to know you.\u003c/p\u003e\n\u003cp\u003eCheers,\nHanan \u0026amp; Clark Recruitment Team\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a8a1e456930770d1ec835659cde46b101f4f18bb/0f654b81-0727-4933-9417-e76fac3fbb5d"
  },
  {
    "id": "5cfc5c04-d90f-11e8-9d50-d2e1d303c48e",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/5cfc5c04-d90f-11e8-9d50-d2e1d303c48e",
    "created_at": "Fri Oct 26 11:08:15 UTC 2018",
    "company": "http://www.paddle.com",
    "company_url": "http://www.paddle.com",
    "location": "London",
    "title": "Senior Python Software Engineer ",
    "description": "\u003cp\u003eYou'll be a part of a friendly and expanding team of talented engineers, working on the newest parts of the \u003cem\u003ePaddle\u003c/em\u003e ecosystem and helping our Software Sellers sell their products on a platform they trust and rely on.\u003c/p\u003e\n\u003cp\u003eOur Engineering department is split into five teams, focusing on different parts of the buyer and seller experience. Teams are fairly static to give every member the chance to become a high performer,, but there's always a chance to try something new. With the engineering team expanding so quickly, values and culture are very important to us, and you'll be expected to help keep the great environment we have currently as we grow.\u003c/p\u003e\n\u003cp\u003eYou are empowered to use the right language for the job for our services, which at the moment for us means using Golang or Python hosted in Lambda, PHP in ECS using docker, and static React sites statically hosted in S3. We will give you the freedom to make technology and tooling decisions and educate the rest of your colleagues accordingly.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you'll do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork on high traffic APIs used by hundreds of active vendors\u003c/li\u003e\n\u003cli\u003eCreate brand new products used by \u003cem\u003ePaddle\u003c/em\u003e\n\u003c/li\u003e\n\u003cli\u003eContribute to designing how \u003cem\u003ePaddle\u003c/em\u003e uses and develops it’s microservices\u003c/li\u003e\n\u003cli\u003eWork collaboratively to design API specifications\u003c/li\u003e\n\u003cli\u003ePractise DevOps, you’re responsible for getting your code to production and supporting it\u003c/li\u003e\n\u003cli\u003eUse the latest cloud services available to run your code\u003c/li\u003e\n\u003cli\u003eWrite performant and well-tested code\u003c/li\u003e\n\u003cli\u003eHelp design a stable platform to support phenomenal growth\u003c/li\u003e\n\u003cli\u003eParticipate in the recruitment process: CV reviews, interviews, reviewing technical ability and cultural fit\u003c/li\u003e\n\u003cli\u003eBe a resource for less senior Engineers to provide mentoring and coaching\u003c/li\u003e\n\u003cli\u003ePlay a part in an agile team - participate in stand-ups, sprint planning \u0026amp; retrospectives\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe'd love to hear from you if\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have competent commercial experience developing applications or other software platforms\u003c/li\u003e\n\u003cli\u003eYou have a strong understanding of the development process from design through to deployment and maintenance and what that means for day-to-day development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour technical skill set includes:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMicroservice architecture, design, and standard methodologies with an eye towards scale.\u003c/li\u003e\n\u003cli\u003eBuilding RESTful APis/ web applications using Python\u003c/li\u003e\n\u003cli\u003eUnit and behavioural testing\u003c/li\u003e\n\u003cli\u003eSQL\u003c/li\u003e\n\u003cli\u003eVersion control systems (preferably Git)\u003c/li\u003e\n\u003cli\u003eExposure to another language, e.g. PHP, Golang, JavaScript, Ruby\u003c/li\u003e\n\u003cli\u003eExposure to cloud providers (preferably AWS)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThings you'll learn on the job\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAWS suite - SQS, EC2, ECS+ECR, CloudFormation, S3, RDS, Cloudwatch\u003c/li\u003e\n\u003cli\u003eDocker containers and micro-service architecture\u003c/li\u003e\n\u003cli\u003eMonitoring and alerting at scale\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy you’ll love working at Paddle\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are a diverse team of just over 100 people (quickly on our way to 180+) based near London Bridge (but moving to Shoreditch by EOY). We care deeply about enabling a great culture which is inclusive no matter your background. We celebrate our diverse group of talented employees and we pride ourselves on our transparent, collaborative, friendly and respectful culture.\u003c/p\u003e\n\u003cp\u003eWe offer a full slate of benefits, including competitive salaries, stock options, pension plans, private healthcare and on-site coaching sessions. We believe in flexible working and offer all team members unlimited holidays and 3 months paid parental leaves regardless of gender. Plus we offer some not-so-standard, extra-fun benefits, which can include anything from joining office football team, taking up in-office yoga lessons or enjoying a board game night. We host regular company get-togethers and quarterly socials. We have weekly catered lunches and of course, fully stocked fridges and cold brew on tap. We value learning and will help you with your personal development where we can — from constant exposure to new challenges and annual learning stipend to regular internal and external training.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur mission is to help software companies succeed — enabling them to focus on creating products the world loves. Hundreds of companies rely on our e-commerce platform to sell their software products globally, as well as our powerful analytics and marketing tools to understand and grow their businesses.\u003c/p\u003e\n\u003cp\u003eOur vision is to become the platform that all software companies use to run and grow their business. We aim to replace a fragmented ecosystem of specialised tools with a unified platform that removes the complex burden that comes with running a software business, whilst also providing unparalleled insight to help them grow faster.\u003c/p\u003e\n\u003cp\u003eWe’re early in our journey but making great progress: Deloitte Fast 50 named us the fastest growing software company in the UK (we’ve tripled revenue every year since our launch in 2012), and we’ve raised over $17m in funding from incredible investors such as Notion, BGF and Kindred.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEqual opportunities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe believe in having diverse teams in which everyone can be their authentic self is key to our success. We encourage people from underrepresented backgrounds to apply and we don't discriminate based on race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, marital status, disability or age. Our office is wheelchair friendly and we are a family-friendly employer​.\u003c/p\u003e\n\u003cp\u003eCome join us, and find out what the best work of your career could look like for you!\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease apply via our website: \u003ca href=\"https://boards.greenhouse.io/paddle/jobs/4107363002?gh_jid=4107363002\"\u003ehttps://boards.greenhouse.io/paddle/jobs/4107363002?gh_jid=4107363002\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b0abd7e6d191b98e36fdf022128b3755200da29a/e0c799c9-8deb-4a76-aaf4-e13cf221ca35"
  },
  {
    "id": "ec37b682-d902-11e8-9f44-b572cb1c6642",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/ec37b682-d902-11e8-9f44-b572cb1c6642",
    "created_at": "Fri Oct 26 09:40:08 UTC 2018",
    "company": "ProntoPro",
    "company_url": "http://www.prontopro.it",
    "location": "Milan, Italy",
    "title": "Frontend Software Engineer ",
    "description": "\u003cp\u003eNOI\u003c/p\u003e\n\u003cp\u003eProntoPro.it è il portale dei professionisti N. 1 in Italia. Aiutiamo milioni di clienti a trovare il professionista di cui hanno bisogno: dal fotografo per il matrimonio, all’idraulico, all’insegnante di chitarra. Stiamo portando meritocrazia e trasparenza in un mercato finora opaco; vogliamo trasformare sia il modo in cui gli italiani scelgono un professionista sia quello in cui i professionisti trovano clienti.\u003c/p\u003e\n\u003cp\u003eSiamo una startup in grandissima crescita: a marzo 2015 eravamo 2 persone, oggi siamo più di 100. 29 anni è l'età media, lavoriamo in open space, e riduciamo al minimo la burocrazia (perchè è semplicemente controproducente), ognuno ha grandi responsabilità e impatta direttamente sul nostro successo.\u003c/p\u003e\n\u003cp\u003eAbbiamo investitori istituzionali del calibro di Immobiliare.it, e angel investor di alto profilo, che lavorano in Google, Facebook, eBay, McKinsey e Unicredit: non abbiamo più i rischi tipici di una startup. Nel 2017 abbiamo avviato il processo di internazionalizzazione conquistando anche il mercato di Austria e Svizzera, e non é finita qua...\u003c/p\u003e\n\u003cp\u003eCerchiamo persone che vogliano costruire un colosso nel mondo del digital italiano che impatti fortemente la vita di tutti noi. Non è un lavoro tranquillo – ci mettiamo il cuore.\u003c/p\u003e\n\u003cp\u003eIL TUO RUOLO\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProntoPro cambierà il modo in cui i clienti trovano i professionisti. Avrai piena visibilità sul business, non solo sulla tua area. Ci si aspetta quindi che tu apporti valore anche a livello architetturale, a livello di prodotto e a livello strategico, senza limitarti ad eseguire ciò che è esplicitamente richiesto.\u003c/li\u003e\n\u003cli\u003eSarai parte del team Technology, oggi composto da 15 (+) persone e che arriverà a 25 entro fine 2018.\u003c/li\u003e\n\u003cli\u003eCreerai un prodotto scalabile che sosterrà la fase di hyper-growth dell'azienda.\u003c/li\u003e\n\u003cli\u003eLavorerai in un ambiente particolarmente attento ai trend tecnologici emergenti e alle metodologie di lavoro agile. In ProntoPro utilizziamo PHP, Symfony, Node.js, SASS, ReactJS, MySQL, AuroraDB, Redis, MongoDB, RabbitMQ, Solr, New Relic, Kubernetes, Docker, Ansible, Git, Drone.io. L’iniziativa personale nell’arricchire/modificare lo stack è un tema a cui siamo molto sensibili, pertanto ci aspettiamo il tuo contributo.\u003c/li\u003e\n\u003cli\u003eParteciperai ad eventi di settore ed avrai la possibilità di raccontare come in ProntoPro abbiamo affrontato e vinto sfide tecnologiche.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTU\u003c/p\u003e\n\u003cp\u003eStiamo cercando un Software Engineer che voglia unirsi al nostro team Technology.\u003c/p\u003e\n\u003cp\u003eCi aspettiamo che tu abbia una solida esperienza in:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJavascript, CSS, SASS, SCSS, manipolazione DOM e JS object model\u003c/li\u003e\n\u003cli\u003eScrivere codice pulito, mantenibile, scalabile e aderente ai principi SOLID\u003c/li\u003e\n\u003cli\u003eAssicurare test coverage del codice prodotto\u003c/li\u003e\n\u003cli\u003eAstrarre il codice prodotto costruendo componenti e librerie riutilizzabili\u003c/li\u003e\n\u003cli\u003eOttimizzare i componenti creati per ottenere massime performances sull'intera gamma di device/browser supportati\u003c/li\u003e\n\u003cli\u003eUtilizzare (e quando necessario creare da zero) client e librerie per consumare servizi REST\u003c/li\u003e\n\u003cli\u003eUtilizzare strumenti di sviluppo e build (Babel, Webpack, NPM, …)\u003c/li\u003e\n\u003cli\u003eRevisionare le pull requests dei tuoi colleghi\u003c/li\u003e\n\u003cli\u003eLavorare in pair programming\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReactJS, Redux e isomorphic React\u003c/li\u003e\n\u003cli\u003eWebSocket\u003c/li\u003e\n\u003cli\u003eLibrerie di data structuring (es. immutable.js)\u003c/li\u003e\n\u003cli\u003ePattern di autenticazione (OAuth2, JWT, …)\u003c/li\u003e\n\u003cli\u003eCreare e gestire applicazioni ed ambienti basati su Docker\u003c/li\u003e\n\u003cli\u003ePipeline di continuous integration/delivery in ambienti come Jenkins e Drone.io\u003c/li\u003e\n\u003cli\u003eConoscenza di altri linguaggi di programmazione (PHP, Python, Ruby, …)\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eSimply send us an email with your CV to \u003ca href=\"mailto:peopleops@prontopro.it\"\u003epeopleops@prontopro.it\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOR apply easily on our website:\n\u003ca href=\"https://prontopro.recruiterbox.com/jobs/fk0hzbs/\"\u003ehttps://prontopro.recruiterbox.com/jobs/fk0hzbs/\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDlYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dcb2d0e46779aae0236b5ce387f65d7a47a55e73/3d97c575-b7f8-4490-a39a-36785dbe6744"
  },
  {
    "id": "0b0b5ff2-d7c1-11e8-88ec-ba50e54bd4a0",
    "type": "remote",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/0b0b5ff2-d7c1-11e8-88ec-ba50e54bd4a0",
    "created_at": "Wed Oct 24 19:14:53 UTC 2018",
    "company": "Stride Consulting",
    "company_url": "https://www.stridenyc.com/",
    "location": "New York, New York",
    "title": "Software Engineer",
    "description": "\u003cp\u003eStride Consulting is a mission-driven, engineering-centric company. We seek developers who place a high value on continuous learning, and value diversity. If you consider yourself a non-dogmatic engineer, have a thirst for learning, and an eye for process, you’ll be in great company.\u003c/p\u003e\n\u003cp\u003eOur goal is to leave our client teams functioning at a higher level than when we found them.  We do this by writing high quality code alongside our clients’ development teams, as well as mentoring their developers, product teams and stakeholders in software development best practices.\u003c/p\u003e\n\u003cp\u003eWe believe that practices like Test Driven Development, Pairing and Refactoring are the foundation of a high functioning software team. And, we believe that not all Agile practices provide equal value to all teams at all times. So, we approach each engagement as the unique opportunity it is.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAs a Strider, you’ll find a learning opportunity that’s unmatched. You will:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe part of an engineering-driven culture, one that has a 4.9 star Glassdoor review and has won Crain’s -Best Places to Work 2 years in a row.\u003c/li\u003e\n\u003cli\u003eWrite high quality code with some of the smartest engineers in town.\u003c/li\u003e\n\u003cli\u003eImmerse yourself in a learning journey that’s second to none. No where else will you find the variety that being a consultant brings, all a subway ride away.\u003c/li\u003e\n\u003cli\u003eMentor and be mentored. Learning weaves a thread through all that we do.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA Day In The Life of a Stride Software Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou’ll co-locate and work onsite at your client (all are in NYC). We are proud to call the most outstanding tech teams in NYC our clients, ranging from funded startups to Fortune 500.\u003c/p\u003e\n\u003cp\u003eYou are empowered to define what work/life balance means to you. Every day for every Strider is different. Here’s how one day might unfold:\u003c/p\u003e\n\u003cp\u003e9am: One-on-one with my manager. We grab coffee at Stumptown and talk about my career goals. I’m noodling on a complex React story and I get my manager’s take. We walk away with action items for next week’s one-on-one.\u003c/p\u003e\n\u003cp\u003e10am: Daily Standup. I’m at work at the client’s office. They’ve got a really cool setup with dual monitors and nice pairing stations. I’m on a team of 4 Striders and 4 client developers. Our Product Manager kicks off the Standup. It lasts about 10 minutes and then we’re off to code.\u003c/p\u003e\n\u003cp\u003e10:10-12:00 Pair Programming. I’m pairing with another Strider. We continue working on the React story from the day before. We have questions for the Product Manager that we ask via Slack.\u003c/p\u003e\n\u003cp\u003e12:00-12:30 Travel to Stride\u003c/p\u003e\n\u003cp\u003e12:30-1:30 Lunch-n-Learn. Today, Stride’s got a Lunch-n-Learn on Terraform Cloud that I’m psyched about. Stacey, one of our senior engineers, is leading the session. We hold Lunch-n-Learns every few weeks and I go to about half of them.\u003c/p\u003e\n\u003cp\u003e1:30-1:45 Travel back to the client’s office.\u003c/p\u003e\n\u003cp\u003e1:45-2:45 Retrospective. Retrospectives on my team are amazing. Today we’re retrospecting our last release. I’ve never facilitated a retrospective before, but my goal is to facilitate one this June. We have a nice rhythm and walk away with action items and confidence in the path ahead.\u003c/p\u003e\n\u003cp\u003e2:45-6 Pair Programming. I get in a few more hours of coding. This afternoon, my pair is Amy, a junior dev who works for the client. I love mentoring and am really excited to have this time to mentor Amy. I’ve been coding about 3 years myself, so at first the idea of mentoring someone else gave me imposter syndrome, but the Stride approach is fluid and allows for flexibility and it’s been a huge career learning experience for me.\u003c/p\u003e\n\u003cp\u003e6pm: Leave for the Day. It’s been a good day, I throw on my headphones as I head to the subway.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll be doing\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWriting high quality code, and bringing a ‘teach a team to fish’ mentality to your project.\u003c/li\u003e\n\u003cli\u003eEmbed with development teams in some of NYC’s most exciting companies to help them up their game and get stuff done.\u003c/li\u003e\n\u003cli\u003eAdvocate for non-dogmatic Agile software development best practices like Test Driven Development (TDD), Pair Programming, Collective Code Ownership, Continuous Deployment, and Continuous Improvement.\u003c/li\u003e\n\u003cli\u003eBe part of a cross functional team that includes Striders (likely 2-6 Strider engineers plus a product manager) and client employees (likely engineers and other tech roles).\u003c/li\u003e\n\u003cli\u003eWork with a variety of tech stacks, and a see a variety of tech teams. We embed with teams who write code in modern tech stacks such as Ruby on Rails, React, Angular, Python, Scala, Java8, Elixir, Node and more.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou’re a fit for Stride if you have:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of software development experience\u003c/li\u003e\n\u003cli\u003eExperience in multiple programming languages\u003c/li\u003e\n\u003cli\u003eExcitement to learn new languages and frameworks\u003c/li\u003e\n\u003cli\u003eExperience with TDD, story estimation, test writing, and pair programming\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you can expect from us:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinuous learning on things that you are passionate about\u003c/li\u003e\n\u003cli\u003eCompetitive Pay and Benefits (including Profit Sharing!)\u003c/li\u003e\n\u003cli\u003eEmpowerment to work at a self-defined Sustainable Pace\u003c/li\u003e\n\u003cli\u003eNo travel, all of our clients are located in NYC\u003c/li\u003e\n\u003cli\u003e$2,000 and up to two weeks of your time for self-directed professional development\u003c/li\u003e\n\u003c/ul\u003e\n",
    "how_to_apply": "\u003cp\u003eFollow this link and submit your application!\n\u003ca href=\"https://grnh.se/48e351b21\"\u003ehttps://grnh.se/48e351b21\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHhYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f1519dc6ab4f7ab9dd26e999a6547bd915811998/c960e5e4-ab0b-4f84-ab8e-2554b72a8f66"
  },
  {
    "id": "7c44cf7c-d713-11e8-89be-b3e23046d61a",
    "type": "Full Time",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/7c44cf7c-d713-11e8-89be-b3e23046d61a",
    "created_at": "Tue Oct 23 22:32:57 UTC 2018",
    "company": "Susco Solutions",
    "company_url": "http://www.suscosolutions.com",
    "location": "New Orleans, LA",
    "title": "Senior .NET Developer",
    "description": "\u003cp\u003eSusco helps businesses grow by creating software customized to their unique needs.  We believe that our work helps people live more fulfilling lives by reducing their repetitive tasks, allowing them to concentrate on more valuable work.\u003c/p\u003e\n\u003cp\u003eSusco is located in the Greater New Orleans Area and is one of the fastest-growing tech companies in Louisiana.  We develop custom web-based business software with a focus on legacy system conversions.  Our primary development platforms are C# .NET for web services, and Ionic/Cordova for mobile apps.\u003c/p\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5 Years web development experience\u003c/li\u003e\n\u003cli\u003eElicitation of requirements from non-technical business users\u003c/li\u003e\n\u003cli\u003eConceptually design systems based on business requirements\u003c/li\u003e\n\u003cli\u003ePerform technical lead role through the SDLC\u003c/li\u003e\n\u003cli\u003eHighly proficient in database design and SQL\u003c/li\u003e\n\u003cli\u003eHighly proficient in a server-side language such as C#, Java, Ruby, Python, or PHP\u003c/li\u003e\n\u003cli\u003eHighly proficient with Javascript\u003c/li\u003e\n\u003cli\u003eExperience with CSS/HTML\u003c/li\u003e\n\u003cli\u003eAbility to adapt to rapidly changing environments\u003c/li\u003e\n\u003cli\u003eSelf-motivated with a positive attitude\u003c/li\u003e\n\u003cli\u003eWillingness to drive projects to completion in a fast-moving environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNice-to-Have\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Kendo UI\u003c/li\u003e\n\u003cli\u003eExperience with Legacy system conversions\u003c/li\u003e\n\u003cli\u003eBS/BA degree\u003c/li\u003e\n\u003cli\u003eAzure experience\u003c/li\u003e\n\u003cli\u003eLinux experience\u003c/li\u003e\n\u003cli\u003eMobile development experience\u003c/li\u003e\n\u003cli\u003eC# Expertise\u003c/li\u003e\n\u003cli\u003eMicrosoft Visual Studio\u003c/li\u003e\n\u003cli\u003eSalesforce Experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eApplication Development, primarily ASP.NET (C#.NET)\u003c/li\u003e\n\u003cli\u003eDatabase Design and Maintenance\u003c/li\u003e\n\u003cli\u003eRequirements analysis\u003c/li\u003e\n\u003cli\u003eAssisting with the development of scope documents and budgets for new work\u003c/li\u003e\n\u003cli\u003ePerform work within allotted hourly budgets and within specific timeframes\u003c/li\u003e\n\u003cli\u003eClient communication\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCompensation\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSalary: $80,000 - $100,000/year\u003c/li\u003e\n\u003cli\u003e3 Weeks PTO + 9 Holidays\u003c/li\u003e\n\u003cli\u003e3 Days/year of self-driven learning time like conferences\u003c/li\u003e\n\u003cli\u003eHealth, Dental, Life, Disability Insurance\u003c/li\u003e\n\u003cli\u003eVarious Wellness activities paid for\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur Core Values\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGrowth\u003c/strong\u003e: We believe we can create a better world by constantly growing as individuals, resulting in growth for the Company and growth for our clients.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAction\u003c/strong\u003e: We believe we don't have good days, we make them.  We believe in being proactive and not reactive. Passivity leads to a lack of involvement, while our focus is on creating the future.  We don't complain, we identify and solve problems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTeamwork\u003c/strong\u003e: We believe that we are human beings first, coworkers second.  We strive to be cognizant as people with lives outside of this office.  As a high-performance organization, there are times of high stress.  In those times, we rally to get the job done and we recognize our behavior and performance impacts our team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEfficiency\u003c/strong\u003e: We believe in learning from our mistakes the first time.  We believe there is a time and place for complex solutions for complex problems.  We also have the ability to decompose complex problems into simpler problems. When we see a problem or inefficiency, we have both the responsibility and ability to propose solutions.\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003e\u003ca href=\"http://careers.suscosolutions.com/apply/b8W5be/Senior-NET-Developer\"\u003ehttp://careers.suscosolutions.com/apply/b8W5be/Senior-NET-Developer\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGhYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a583748c64683a61f69820356121822fc877418e/0fa7beb8-d72e-4f11-8509-5394c2375b87"
  },
  {
    "id": "95048694-1952-11e8-86d5-38e7f24d7ed9",
    "type": "remote",
    "job_type": "jobs",
    "url": "https://jobs.github.com/positions/95048694-1952-11e8-86d5-38e7f24d7ed9",
    "created_at": "Sun Oct 21 23:46:24 UTC 2018",
    "company": "Analytics Fire",
    "company_url": "http://analyticsfire.com",
    "location": "Remote",
    "title": "SENIOR FULL-STACK DEV WITH RUBY/PYTHON/REACT -- 100% REMOTE, FLEXIBLE HOURS",
    "description": "\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire builds custom software for the solar power industry. We’re looking for a senior full-stack developer with a willingness to acquire deep expertise around Ruby, Python, and React.js, in order to help us expand to support additional new high-tech sectors.\u003c/p\u003e\n\u003cp\u003eAnalytics Fire is a small, distributed team working on a range of interesting projects. For example, last year we worked on a scalable IoT platform for utility grade solar power plants, a sales and design tool for residential solar, and a machine-learning powered autonomous cleaning robot. We’re looking for a fun, reliable, and highly collaborative, senior dev to join our team.\nFor reference, here is a list of technologies and tools we are currently actively using on a day-to-day basis:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFront-end: JavaScript / React / Angular\u003c/li\u003e\n\u003cli\u003eBack-end: Ruby / Python / Node.js\u003c/li\u003e\n\u003cli\u003eEmbedded (IoT): C, Embedded Linux, MQTT\u003c/li\u003e\n\u003cli\u003eEmbedded (robotics): C/C++, ROS\u003c/li\u003e\n\u003cli\u003eModern software techniques: RESTful APIs, SOA, PaaS, etc\u003c/li\u003e\n\u003cli\u003eAgile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc\u003c/li\u003e\n\u003cli\u003eOccasionally we need to do a small amount of work around: SFDC, iOS, Android, ARKit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is a remote position. We’re flexible about location and hours, so long as your working hours are in a very heavily US-overlapping time zone (eg: North America, Central America, South America, etc). We’re a really great match for a senior dev in a US-overlapping timezone who wants to work hard on interesting projects, while also having flexibility around time and geography.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSkills \u0026amp; Requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIdeally, you should have 5+ years commercial full stack development, ideally within a startup environment. You should be comfortable autonomously driving your own high quality / high velocity contributions using a range of technologies.\u003c/p\u003e\n\u003cp\u003eWe work with a variety of technologies, but are currently specifically looking for someone that has or can obtain expert level skills around Python, Ruby, and React.js.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Analytics Fire\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnalytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.\u003c/p\u003e\n\u003cp\u003e“Our goal founding, Analytics Fire, was to create the engineering department that we always dreamed of working for. Our dream is to be able to spend our time working on interesting problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”\u003c/p\u003e\n",
    "how_to_apply": "\u003cp\u003ePlease email your resume and cover letter to \u003ca href=\"mailto:join-us@analyticsfire.com\"\u003ejoin-us@analyticsfire.com\u003c/a\u003e\u003c/p\u003e\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2xYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--89248bd5c549d217b732c30844d17e6d0564f721/37d142ea-7772-45d9-8ebd-7fd489926dad"
  }]